literate-config.org
# -*- mode:org; coding: utf-8; -*-
#+TITLE: Prady_runcom
#+AUTHOR: Pradyumna Paranjape
#+EMAIL: pradyparanjpe@rediffmail.com
#+LANGUAGE: en
#+OPTIONS: toc:2 num:nil html-postamble:nil ^:nil mathjax:t TeX:t ::t tags:nil *:t skip:t ^:nil
#+STARTUP: overview
#+PROPERTY: header-args :tangle
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style> @media only screen and (max-width: 960px) {#content{background-color: #e7f0f7; color: 101018; max-width: 100%; overflow-x: scroll;}} </style>
#+HTML_HEAD: <style> body{background-color: #e7f0f7; color: 101018; font-size: 18px;} </style>
#+HTML_HEAD: <style> #content{background-color: #e7f0f7; color: 101018;} </style>
#+HTML_HEAD: <style> #left-panel-button{display: none;}</style>
#+HTML_HEAD: <style> #minitoc{display: none;}</style>
#+HTML_HEAD: <style> #tabs{background-color: #e5e7ea; font-size: 18px;} </style>
#+HTML_HEAD: <style> #tabs li a{background-color: #e5e7ea; font-size: 18px;} </style>
#+HTML_HEAD: <style> .buttons{background-color: #f2f3f4;} </style>
#+HTML_HEAD: <style> #table-of-contents header{background-color: #e7f0f7; color: 101018;}</style>
#+HTML_HEAD: <style> table, th, td {border: none; border-left: none; border-right: none;} </style>
#+HTML_HEAD: <style> b{background-color: #e7f0f7; color: #000000;} </style>
#+HTML_HEAD: <style> i{background-color: #e7f0f7; color: 101018;} </style>
#+HTML_HEAD: <style> a, a:link, a:visited, a:hover{color: #0087bf; text-decoration: none}</style>
#+HTML_HEAD: <style> h1{color: #e00030; background: #f6fafe; font-size: 2em;} </style>
#+HTML_HEAD: <style> h2{color: #0040c0; font-size: 1.75em; border-bottom: 1px solid #585c60;} </style>
#+HTML_HEAD: <style> h3{color: #00c060; font-size: 1.5em; border-bottom: 1px dotted #585c60;} </style>
#+HTML_HEAD: <style> h4{color: #7f8f00; font-size: 1.25em; border-bottom: none;} </style>
#+HTML_HEAD: <style> code{color: #4f0000; background: #ffffff; font-weight: bold} </style>
#+HTML_HEAD: <style> table thead th{background-color: #ffffff;}</style>
#+HTML_HEAD: <style> table tr:nth-child(2n-1) td{background-color: #e7e7ef;}</style>
#+HTML_HEAD: <style> table tr:nth-child(2n) td{background-color: #f7f7ff;}</style>
#+LATEX_CMD: xelatex
#+LATEX_COMPILER: xelatex
#+LATEX_HEADER: \usepackage[a4paper, margin=1in]{geometry}
#+LATEX_HEADER: \usepackage[perpage]{footmisc}
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \usepackage{polyglossia}
#+LATEX_HEADER: \newfontfamily \devanagarifont[Script=Devanagari]{Lohit Devanagari}
#+LATEX_HEADER: \setmainlanguage{sanskrit}
#+LATEX_HEADER: \setotherlanguages{english}
#+LATEX: \today



* Copyright/License Header
  Copyright 2020, 2021 Pradyumna Paranjape

  This file is part of Prady_runcom.

  Prady_runcom is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Prady_runcom is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Prady_runcom.  If not, see <https://www.gnu.org/licenses/>.

* What is this?
  Following configuration files are available. This literate configuration tangles their contents.
  |-----------------------------------+-------|
  | Configuration File Path           | POSIX |
  |                                   |       |
  |-----------------------------------+-------|
  | /etc/profile       (system)       | yes   |
  | /etc/bashrc        (system)       | yes   |
  | /etc/zshrc         (system)       | yes   |
  | /etc/profile.d/*   (system)       | yes   |
  | ${HOME}/.bashrc                   | no    |
  | ${HOME}/.zshrc                    | no    |
  | ${HOME}/.bash_profile             | yes   |
  | ${HOME}/.bash_login               | yes   |
  | ${HOME}/.profile                  | yes   |
  | ${HOME}/.zprofile                 | yes   |
  | ${HOME}/.zlogin                   | yes   |
  | ${HOME}/.bash_completion.d/*      | no    |
  | ${RUNCOMDIR}/bashrc               | no    |
  | ${RUNCOMDIR}/local.d/*            | no    |
  | ${RUNCOMDIR}/zshrc                | no    |
  | ${RUNCOMDIR}/shrc                 | yes   |
  | ${RUNCOMDIR}/profile              | yes   |
  | ${RUNCOMDIR}/bash_login           | yes   |
  | ${RUNCOMDIR}/zlogin               | yes   |
  | ${RUNCOMDIR}/ui                   | yes   |
  | ${RUNCOMDIR}/complete.bash        | yes   |
  | ${XDG_CONFIG_HOME}/varrc          | yes   |
  | ${XDG_CONFIG_HOME}/pspman/profile | yes   |
  |-----------------------------------+-------|
  They are loaded in following order.

** Bash
*** /etc/profile
**** /etc/bashrc
***** /etc/profile.d/*


*** ${HOME}/.bash_profile

**** ${HOME}/.profile
***** ${XDG_CONFIG_HOME}/varrc
***** ${RUNCOMDIR}/profile
***** ${XDG_CONFIG_HOME}/pspman/profile

**** ${HOME}/.bashrc
***** ${RUNCOMDIR}/bashrc
****** ${RUNCOMDIR}/shrc
******* ${RUNCOMDIR}/local.d/*

**** ${HOME}/.bash_login
***** ${RUNCOMDIR}/bash_login
****** ${RUNCOMDIR}/ui

** Zsh
*** /etc/profile
**** /etc/zshrc
***** /etc/profile.d/*

*** ${HOME}/.zshenv

*** ${HOME}/.zprofile
**** ${HOME}/.profile
***** ${XDG_CONFIG_HOME}/varrc
***** ${RUNCOMDIR}/profile
***** ${XDG_CONFIG_HOME}/pspman/profile

*** ${HOME}/.zshrc
**** ${RUNCOMDIR}/zshrc
***** ${RUNCOMDIR}/shrc
****** ${RUNCOMDIR}/local.d/*

*** ${HOME}/.zlogin
**** ${RUNCOMDIR}/zlogin
***** ${RUNCOMDIR}/ui

