docs/literate-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-13 Fri 13:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prady_runcom</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pradyumna Paranjape" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Prady_runcom</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb46e8e9">Copyright/License Header</a></li>
<li><a href="#org07de505">What is this?</a>
<ul>
<li><a href="#org13641cb">Bash</a></li>
<li><a href="#orgb39f69f">Zsh</a></li>
</ul>
</li>
<li><a href="#org908c19c">Headers</a></li>
<li><a href="#org8ee8414">Init</a>
<ul>
<li><a href="#org9896723">bash</a></li>
<li><a href="#org6400948">zsh</a></li>
</ul>
</li>
<li><a href="#org4a3d484">Inherit</a>
<ul>
<li><a href="#org3b82b54">bash</a></li>
<li><a href="#orge8dc428">zsh</a></li>
<li><a href="#orgf555735">shrc</a></li>
</ul>
</li>
<li><a href="#org9212146">Better alternatives</a>
<ul>
<li><a href="#orgf304715">cat</a></li>
<li><a href="#orge2cd774">g/re/p</a></li>
<li><a href="#org729a6ac">List Contents</a></li>
<li><a href="#orgab2d409">neo visual editor improved</a></li>
<li><a href="#orgaa87844">Container</a></li>
</ul>
</li>
<li><a href="#org2c2eade">Variables</a>
<ul>
<li><a href="#orgec146b7">PATH</a></li>
<li><a href="#orge2169af">Editor wars</a></li>
<li><a href="#orga079923">C(++) exports</a></li>
<li><a href="#org5a740f5">GPU exports</a></li>
<li><a href="#orgb7d68e6">Bemenu exports</a></li>
<li><a href="#org5c17fe4">GTK+ debugging output</a></li>
</ul>
</li>
<li><a href="#org14d896a">Functions</a>
<ul>
<li><a href="#orgda1b479">Python</a></li>
<li><a href="#org672c4fd">Git</a></li>
<li><a href="#org0c257dc">Prompt String</a></li>
<li><a href="#org7d6d985">Mathematical</a></li>
<li><a href="#orgea9bcba">Compilation</a></li>
<li><a href="#org6c2e27e">Mount Home Server</a></li>
<li><a href="#org4043936">Launch gui</a></li>
<li><a href="#org6cb268f">Un-Compress by context</a></li>
<li><a href="#orge181ee1">Navigate</a></li>
<li><a href="#org6cfe849">zwc</a></li>
<li><a href="#orgd22bc95">disable autovenv</a></li>
<li><a href="#orge7b1dba">lszcat</a></li>
<li><a href="#orgab69296">manual pages</a></li>
</ul>
</li>
<li><a href="#orgc94658d">Aliases</a>
<ul>
<li><a href="#org2c0b6c8">Disk Usage</a></li>
<li><a href="#org4bc2c02">manual page help</a></li>
<li><a href="#org7b293d4">Network</a></li>
<li><a href="#orgf9fdd9f">Monitor Job queues</a></li>
<li><a href="#org1ae983d">Lazy single-handed exit</a></li>
<li><a href="#orge2f084f">[z]wc</a></li>
</ul>
</li>
<li><a href="#orgef497b6">Networking</a>
<ul>
<li><a href="#orgd59fcd7">State</a></li>
<li><a href="#org7b89bb9">SSH Agent</a></li>
</ul>
</li>
<li><a href="#orge1abd8b">Window Manager settings</a>
<ul>
<li><a href="#org563f013">Terminal</a></li>
<li><a href="#orge2689ee">Sway exports</a></li>
<li><a href="#orge674b6b">User Interface (GUI/CLI)</a></li>
</ul>
</li>
<li><a href="#orgc9b5591">Calls</a>
<ul>
<li><a href="#orga4a0bc2">bash</a></li>
<li><a href="#orgc7f973b">zsh</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgb46e8e9" class="outline-2">
<h2 id="orgb46e8e9">Copyright/License Header</h2>
<div class="outline-text-2" id="text-orgb46e8e9">
<p>
Copyright 2020, 2021 Pradyumna Paranjape
</p>

<p>
This file is part of Prady_runcom.
</p>

<p>
Prady_runcom is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.
</p>

<p>
Prady_runcom is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with Prady_runcom.  If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
</p>
</div>
</div>

<div id="outline-container-org07de505" class="outline-2">
<h2 id="org07de505">What is this?</h2>
<div class="outline-text-2" id="text-org07de505">
<p>
Following configuration files are available. This literate configuration tangles their contents.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Configuration File Path</th>
<th scope="col" class="org-left">POSIX</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/etc/profile       (system)</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">/etc/bashrc        (system)</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">/etc/zshrc         (system)</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">/etc/profile.d/*   (system)</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${HOME}/.bashrc</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">${HOME}/.zshrc</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">${HOME}/.bash_profile</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${HOME}/.bash_login</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${HOME}/.profile</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${HOME}/.zprofile</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${HOME}/.zlogin</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${HOME}/.bash_completion.d/*</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/bashrc</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/local.d/*</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/zshrc</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/shrc</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/profile</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/bash_login</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/zlogin</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/ui</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${RUNCOMDIR}/complete.bash</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${XDG_CONFIG_HOME}/varrc</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">${XDG_CONFIG_HOME}/pspman/profile</td>
<td class="org-left">yes</td>
</tr>
</tbody>
</table>
<p>
They are loaded in following order.
</p>
</div>
