literate-config.org
* Init
** bash
   Settings
   #+BEGIN_SRC bash :tangle bashrc
     shopt -s autocd
     set -o vi
     bind '"jk":vi-movement-mode'
   #+END_SRC

** zsh
   Settings
   Unset options:
   - setopt SHARE_HISTORY             # Share history between all sessions.
   - setopt HIST_BEEP                 # Beep when accessing nonexistent history.
   - HISTCONTROL=ignoreboth           # ignore commands staring with " " and duplicate
     #+BEGIN_SRC bash :tangle zshrc
       HISTFILE="${XDG_CACHE_HOME:-${HOME}/.cache}/.zhistory"
       HISTSIZE=10000
       SAVEHIST=10000
       ZSH_AUTOSUGGEST_HIGHLIGHT_STYLE="fg=#5f6f7f,bg=#172737"
       ZSH_AUTOSUGGEST_STRATEGY=("history" "completion")
       setopt autocd
       setopt interactive_comments
       setopt appendhistory extendedglob notify
       setopt BANG_HIST                 # Treat the '!' character specially during expansion.
       setopt EXTENDED_HISTORY          # Write the history file in the ":start:elapsed;command" format.
       setopt INC_APPEND_HISTORY        # Write to the history file immediately, not when the shell exits.
       setopt HIST_EXPIRE_DUPS_FIRST    # Expire duplicate entries first when trimming history.
       setopt HIST_IGNORE_DUPS          # Don't record an entry that was just recorded again.
       setopt HIST_IGNORE_ALL_DUPS      # Delete old recorded entry if new entry is a duplicate.
       setopt HIST_FIND_NO_DUPS         # Do not display a line previously found.
       setopt HIST_SAVE_NO_DUPS         # Don't write duplicate entries in the history file.
       setopt HIST_IGNORE_SPACE         # Don't record an entry starting with a space.
       setopt HIST_REDUCE_BLANKS        # Remove superfluous blanks before recording entry.
       setopt HIST_VERIFY               # Don't execute immediately upon history expansion.
       unsetopt beep
       autoload colors && colors
       autoload add-zsh-hook
       term_key_source="${HOME}/.zkbd/$TERM-${${DISPLAY:t}:-$VENDOR-$OSTYPE}"
       if [ -f "${term_key_source}" ]; then
           source "${term_key_source}"
       fi
       # vim keybindings
       bindkey -v
       bindkey -s '^o' 'lfcd\n'
       bindkey -s '^f' 'fzfcd\n'
       bindkey '^[[P' delete-char  # backspace key
       bindkey '^[[1;5D' vi-backward-word  # ctrl <-
       bindkey '^[[1;5C' vi-forward-word  # ctrl ->
       bindkey '^[[3~' vi-delete-char  # delete key
       bindkey '^[[F' vi-end-of-line  # end key
       bindkey '^[[H' vi-beginning-of-line  # home key
       bindkey "^[[27;2;13~" vi-open-line-below  # shift Return
       export KEYTIMEOUT=10

       # Use beam shape cursor for each new prompt.
       _fix_cursor () {
           echo -ne '\e[6 q'
       }
       add-zsh-hook precmd _fix_cursor

       # Change cursor shape for different vi modes.
       zle-keymap-select () {
           if [ "${KEYMAP}" = "vicmd" ] ||
                  [ "${1}" = 'block' ]; then
               printf '\e[2 q'

           elif [ "${KEYMAP}" = "main" ] ||
                    [ "${KEYMAP}" = "viins" ] ||
                    [ "${KEYMAP}" = '' ] ||
                    [ "${1}" = 'beam' ]; then
               printf '\e[6 q'
           elif [ "${KEYMAP}" = "visual" ]; then
               printf '\e[4 q'
           fi
       }
       # Use vim keys in tab complete menu:
       zmodload zsh/complist
       zmodload zsh/mapfile
       bindkey -M menuselect 'h' vi-backward-char
       bindkey -M menuselect 'k' vi-up-line-or-history
       bindkey -M menuselect 'l' vi-forward-char
       bindkey -M menuselect 'j' vi-down-line-or-history
       bindkey -v '^?' backward-delete-char
       bindkey -M viins 'jk' vi-cmd-mode
       bindkey '^r' history-incremental-search-backward

       zle -N zle-keymap-select

     #+END_SRC

* Inherit
** bash
   #+BEGIN_SRC bash :tangle bashrc
     # shellcheck source=".runcom/shrc"
     if [ -f "${RUNCOMDIR}"/shrc ]; then
         . "${RUNCOMDIR}"/shrc
     fi
   #+END_SRC

