docs/literate-config.html

<div id="outline-container-org8ee8414" class="outline-2">
<h2 id="org8ee8414">Init</h2>
<div class="outline-text-2" id="text-org8ee8414">
</div>
<div id="outline-container-org9896723" class="outline-3">
<h3 id="org9896723">bash</h3>
<div class="outline-text-3" id="text-org9896723">
<p>
Settings
</p>
<div class="org-src-container">
<pre class="src src-bash">shopt -s autocd
<span style="color: #d76f10;">set</span> -o vi
bind <span style="color: #98be65;">'"jk":vi-movement-mode'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6400948" class="outline-3">
<h3 id="org6400948">zsh</h3>
<div class="outline-text-3" id="text-org6400948">
<p>
Settings
Unset options:
</p>
<ul class="org-ul">
<li>setopt SHARE_HISTORY             # Share history between all sessions.</li>
<li>setopt HIST_BEEP                 # Beep when accessing nonexistent history.</li>
<li><p>
HISTCONTROL=ignoreboth           # ignore commands staring with " " and duplicate
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ffffaf;">HISTFILE</span>=<span style="color: #98be65;">"${XDG_CACHE_HOME:-${HOME}/.cache}/.zhistory"</span>
<span style="color: #ffffaf;">HISTSIZE</span>=<span style="color: #da8548; font-weight: bold;">10000</span>
<span style="color: #ffffaf;">SAVEHIST</span>=<span style="color: #da8548; font-weight: bold;">10000</span>
<span style="color: #ffffaf;">ZSH_AUTOSUGGEST_HIGHLIGHT_STYLE</span>=<span style="color: #98be65;">"fg=</span><span style="color: #ffffff; background-color: #5f6f7f;">#5f6f7f</span><span style="color: #98be65;">,bg=</span><span style="color: #ffffff; background-color: #172737;">#172737</span><span style="color: #98be65;">"</span>
<span style="color: #ffffaf;">ZSH_AUTOSUGGEST_STRATEGY</span>=<span style="color: #51afef;">(</span><span style="color: #98be65;">"history"</span> <span style="color: #98be65;">"completion"</span><span style="color: #51afef;">)</span>
<span style="color: #d76f10;">setopt</span> autocd
<span style="color: #d76f10;">setopt</span> interactive_comments
<span style="color: #d76f10;">setopt</span> appendhistory extendedglob notify
<span style="color: #d76f10;">setopt</span> BANG_HIST                 <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Treat the '!' character specially during expansion.</span>
<span style="color: #d76f10;">setopt</span> EXTENDED_HISTORY          <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Write the history file in the ":start:elapsed;command" format.</span>
<span style="color: #d76f10;">setopt</span> INC_APPEND_HISTORY        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Write to the history file immediately, not when the shell exits.</span>
<span style="color: #d76f10;">setopt</span> HIST_EXPIRE_DUPS_FIRST    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Expire duplicate entries first when trimming history.</span>
<span style="color: #d76f10;">setopt</span> HIST_IGNORE_DUPS          <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Don't record an entry that was just recorded again.</span>
<span style="color: #d76f10;">setopt</span> HIST_IGNORE_ALL_DUPS      <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Delete old recorded entry if new entry is a duplicate.</span>
<span style="color: #d76f10;">setopt</span> HIST_FIND_NO_DUPS         <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Do not display a line previously found.</span>
<span style="color: #d76f10;">setopt</span> HIST_SAVE_NO_DUPS         <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Don't write duplicate entries in the history file.</span>
<span style="color: #d76f10;">setopt</span> HIST_IGNORE_SPACE         <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Don't record an entry starting with a space.</span>
<span style="color: #d76f10;">setopt</span> HIST_REDUCE_BLANKS        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Remove superfluous blanks before recording entry.</span>
<span style="color: #d76f10;">setopt</span> HIST_VERIFY               <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Don't execute immediately upon history expansion.</span>
<span style="color: #d76f10;">unsetopt</span> beep
<span style="color: #d76f10;">autoload</span> colors &amp;&amp; colors
<span style="color: #d76f10;">autoload</span> add-zsh-hook
<span style="color: #ffffaf;">term_key_source</span>=<span style="color: #98be65;">"${HOME}/.zkbd/$TERM-${${DISPLAY:t}:-$VENDOR-$OSTYPE}"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -f <span style="color: #98be65;">"${term_key_source}"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    <span style="color: #d76f10;">source</span> <span style="color: #98be65;">"${term_key_source}"</span>
<span style="color: #51afef;">fi</span>
<span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">keybindings</span>
<span style="color: #d76f10;">bindkey</span> -v
<span style="color: #d76f10;">bindkey</span> -s <span style="color: #98be65;">'^o'</span> <span style="color: #98be65;">'lfcd\n'</span>
<span style="color: #d76f10;">bindkey</span> -s <span style="color: #98be65;">'^f'</span> <span style="color: #98be65;">'fzfcd\n'</span>
<span style="color: #d76f10;">bindkey</span> -s <span style="color: #98be65;">'^E'</span> <span style="color: #98be65;">'deactivate 2&gt;/dev/null || true\n'</span>
<span style="color: #d76f10;">bindkey</span> -s <span style="color: #98be65;">'^N'</span> <span style="color: #98be65;">'force_global_venv\n'</span>
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">'^[[P'</span> delete-char  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">backspace key</span>
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">'^[[1;5D'</span> vi-backward-word  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">ctrl &lt;-</span>
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">'^[[1;5C'</span> vi-forward-word  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">ctrl -&gt;</span>
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">'^[[3~'</span> vi-delete-char  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">delete key</span>
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">'^[[F'</span> vi-end-of-line  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">end key</span>
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">'^[[H'</span> vi-beginning-of-line  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">home key</span>
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">"^[[27;2;13~"</span> vi-open-line-below  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shift Return</span>
<span style="color: #d76f10;">export</span> <span style="color: #ffffaf;">KEYTIMEOUT</span>=<span style="color: #da8548; font-weight: bold;">10</span>

<span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Use beam shape cursor for each new prompt.</span>
<span style="color: #9f5f9f; font-weight: bold;">_fix_cursor</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #d76f10;">echo</span> -ne <span style="color: #98be65;">'\e[6 q'</span>
<span style="color: #51afef;">}</span>
add-zsh-hook precmd _fix_cursor

<span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Change cursor shape for different vi modes.</span>
<span style="color: #9f5f9f; font-weight: bold;">zle-keymap-select</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${KEYMAP}"</span> = <span style="color: #98be65;">"vicmd"</span> <span style="color: #c678dd;">]</span> ||
           <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${1}"</span> = <span style="color: #98be65;">'block'</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        printf <span style="color: #98be65;">'\e[2 q'</span>

    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${KEYMAP}"</span> = <span style="color: #98be65;">"main"</span> <span style="color: #c678dd;">]</span> ||
             <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${KEYMAP}"</span> = <span style="color: #98be65;">"viins"</span> <span style="color: #c678dd;">]</span> ||
             <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${KEYMAP}"</span> = <span style="color: #98be65;">''</span> <span style="color: #c678dd;">]</span> ||
             <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${1}"</span> = <span style="color: #98be65;">'beam'</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        printf <span style="color: #98be65;">'\e[6 q'</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${KEYMAP}"</span> = <span style="color: #98be65;">"visual"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        printf <span style="color: #98be65;">'\e[4 q'</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
<span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Use vim keys in tab complete menu:</span>
zmodload zsh/complist
zmodload zsh/mapfile
<span style="color: #d76f10;">bindkey</span> -M menuselect <span style="color: #98be65;">'h'</span> vi-backward-char
<span style="color: #d76f10;">bindkey</span> -M menuselect <span style="color: #98be65;">'k'</span> vi-up-line-or-history
<span style="color: #d76f10;">bindkey</span> -M menuselect <span style="color: #98be65;">'l'</span> vi-forward-char
<span style="color: #d76f10;">bindkey</span> -M menuselect <span style="color: #98be65;">'j'</span> vi-down-line-or-history
<span style="color: #d76f10;">bindkey</span> -v <span style="color: #98be65;">'^?'</span> backward-delete-char
<span style="color: #d76f10;">bindkey</span> -M viins <span style="color: #98be65;">'jk'</span> vi-cmd-mode
<span style="color: #d76f10;">bindkey</span> <span style="color: #98be65;">'^r'</span> history-incremental-search-backward

zle -N zle-keymap-select

</pre>
</div></li>
</ul>
</div>
</div>
</div>
