literate-config.org
** zsh
   #+BEGIN_SRC bash :tangle zshrc
     # shellcheck source=".runcom/shrc"
     if [ -f "${RUNCOMDIR}"/shrc ]; then
         . "${RUNCOMDIR}"/shrc
     fi
     while read -r addition; do
         while read -r share_dir; do
             add_dir="${share_dir}/zsh-${addition}"
             if [ -d "${add_dir}" ]; then
                 # shellcheck disable=SC1090
                 . "${add_dir}/zsh-${addition}.zsh"
                 break
             fi
         done << data_dir
     /usr/local/share
     /usr/share
     ${XDG_DATA_HOME:-${HOME}/.local/share}
     ${XDG_DATA_HOME:-${HOME}/.local/share}/pspman/local/share
     ${HOME}/local/share
     ${HOME}/share
     data_dir
     done << addlist
     syntax-highlighting
     autosuggestions
     addlist

     unset addition
     unset share_dir
     unset add_dir


   #+END_SRC

** shrc
*** Local unsynced changes
    All files in ${RUNCOMDIR}/local.d will be sourced
    #+BEGIN_SRC sh :tangle shrc
      # shellcheck disable=SC1090
      if [ -d "${RUNCOMDIR}"/local.d ]; then
          for local_src in "${RUNCOMDIR}"/local.d/*; do
              . "${local_src}"
          done
      fi
      unset local_src
    #+END_SRC

*** Python
    [[https://github.com/kislyuk/argcomplete][Argcomplete]] to complete python commands
    #+BEGIN_SRC sh :tangle shrc
      # shellcheck source=.local/share/pspman/src/runcom/complete.bash
      if [ -f "${RUNCOMDIR}"/complete.bash ]; then
          # shellcheck source=.local/share/pspman/src/runcom/complete.bash
          . "${RUNCOMDIR}"/complete.bash
      fi
    #+END_SRC

* Better alternatives
** cat
   #+BEGIN_SRC sh :tangle shrc
     if builtin command -v 'bat' >/dev/null 2>&1; then
         alias cat="bat --color=auto";
     fi
   #+END_SRC

** g/re/p
   #+BEGIN_SRC sh :tangle shrc
     for sc in "ack" "pt" "ag" "rg"; do
         if builtin command -v "${sc%% *}" >/dev/null 2>&1; then
             # shellcheck disable=SC2139
             alias grep="${sc} --color=auto";
         fi
     done
   #+END_SRC

** List Contents
   #+BEGIN_SRC sh :tangle shrc
     if builtin command -v "exa" >/dev/null 2>&1; then
         alias ls="exa -Fh --color=auto";
         alias la='exa -a --color=auto';
         alias ll='exa -lr -s size';
         alias lla='exa -a';
         alias l.='exa -a --color=auto |grep "^\."';
         alias sl="ls";
     fi
   #+END_SRC

** neo visual editor improved
   #+BEGIN_SRC sh :tangle shrc
     if builtin command -v nvim >/dev/null 2>&1; then
         alias ex="nvim"; # always open vim in normal mode
         alias vim="nvim"; # always use neo
     fi
   #+END_SRC

** Container
   #+BEGIN_SRC sh :tangle shrc
     if builtin command -v podman >/dev/null 2>&1; then
         alias docker="podman";  # Podman is drop-in replacement for docker
         alias docker-compose="podman-compose";  # Podman is drop-in replacement for docker
     fi
   #+END_SRC

* Variables
