docs/literate-config.html

<div id="outline-container-org4a3d484" class="outline-2">
<h2 id="org4a3d484">Inherit</h2>
<div class="outline-text-2" id="text-org4a3d484">
</div>
<div id="outline-container-org3b82b54" class="outline-3">
<h3 id="org3b82b54">bash</h3>
<div class="outline-text-3" id="text-org3b82b54">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=".runcom/shrc"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -f <span style="color: #98be65;">"${RUNCOMDIR}"</span>/shrc <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    . <span style="color: #98be65;">"${RUNCOMDIR}"</span>/shrc
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8dc428" class="outline-3">
<h3 id="orge8dc428">zsh</h3>
<div class="outline-text-3" id="text-orge8dc428">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=".runcom/shrc"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -f <span style="color: #98be65;">"${RUNCOMDIR}"</span>/shrc <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    . <span style="color: #98be65;">"${RUNCOMDIR}"</span>/shrc
<span style="color: #51afef;">fi</span>
<span style="color: #51afef;">while </span><span style="color: #d76f10;">read</span> -r addition; <span style="color: #51afef;">do</span>
    <span style="color: #51afef;">while </span><span style="color: #d76f10;">read</span> -r share_dir; <span style="color: #51afef;">do</span>
        <span style="color: #ffffaf;">add_dir</span>=<span style="color: #98be65;">"${share_dir}/zsh-${addition}"</span>
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -d <span style="color: #98be65;">"${add_dir}"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC1090</span>
            . <span style="color: #98be65;">"${add_dir}/zsh-${addition}.zsh"</span>
            <span style="color: #51afef;">break</span>
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">done</span> &lt;&lt; data_dir
<span style="color: #98be65;">/usr/local/share</span>
<span style="color: #98be65;">/usr/share</span>
<span style="color: #98be65;">${XDG_DATA_HOME:-${HOME}/.local/share}</span>
<span style="color: #98be65;">${XDG_DATA_HOME:-${HOME}/.local/share}/pspman/local/share</span>
<span style="color: #98be65;">${HOME}/local/share</span>
<span style="color: #98be65;">${HOME}/share</span>
<span style="color: #98be65;">data_dir</span>
<span style="color: #51afef;">done</span> &lt;&lt; addlist
<span style="color: #98be65;">syntax-highlighting</span>
<span style="color: #98be65;">autosuggestions</span>
<span style="color: #98be65;">addlist</span>

<span style="color: #d76f10;">unset</span> addition
<span style="color: #d76f10;">unset</span> share_dir
<span style="color: #d76f10;">unset</span> add_dir


</pre>
</div>
</div>
</div>

<div id="outline-container-orgf555735" class="outline-3">
<h3 id="orgf555735">shrc</h3>
<div class="outline-text-3" id="text-orgf555735">
</div>
<div id="outline-container-org25c51f8" class="outline-4">
<h4 id="org25c51f8">Local unsynced changes</h4>
<div class="outline-text-4" id="text-org25c51f8">
<p>
All files in ${RUNCOMDIR}/local.d will be sourced
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC1090</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -d <span style="color: #98be65;">"${RUNCOMDIR}"</span>/local.d <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    <span style="color: #51afef;">for</span> local_src<span style="color: #51afef;"> in</span> <span style="color: #98be65;">"${RUNCOMDIR}"</span>/local.d/*; <span style="color: #51afef;">do</span>
        . <span style="color: #98be65;">"${local_src}"</span>
    <span style="color: #51afef;">done</span>
<span style="color: #51afef;">fi</span>
<span style="color: #d76f10;">unset</span> local_src
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9ecf55" class="outline-4">
<h4 id="orgf9ecf55">Python</h4>
<div class="outline-text-4" id="text-orgf9ecf55">
<p>
<a href="https://github.com/kislyuk/argcomplete">Argcomplete</a> to complete python commands
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=.local/share/pspman/src/runcom/complete.bash</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -f <span style="color: #98be65;">"${RUNCOMDIR}"</span>/complete.bash <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=.local/share/pspman/src/runcom/complete.bash</span>
    . <span style="color: #98be65;">"${RUNCOMDIR}"</span>/complete.bash
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org9212146" class="outline-2">
<h2 id="org9212146">Better alternatives</h2>
<div class="outline-text-2" id="text-org9212146">
</div>
<div id="outline-container-orgf304715" class="outline-3">
<h3 id="orgf304715">cat</h3>
<div class="outline-text-3" id="text-orgf304715">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v <span style="color: #98be65;">'bat'</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">cat</span>=<span style="color: #98be65;">"bat --color=auto"</span>;
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2cd774" class="outline-3">
<h3 id="orge2cd774">g/re/p</h3>
<div class="outline-text-3" id="text-orge2cd774">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">for</span> sc<span style="color: #51afef;"> in</span> <span style="color: #98be65;">"ack"</span> <span style="color: #98be65;">"pt"</span> <span style="color: #98be65;">"ag"</span> <span style="color: #98be65;">"rg"</span>; <span style="color: #51afef;">do</span>
    <span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v <span style="color: #98be65;">"${sc%% *}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2139</span>
        <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">grep</span>=<span style="color: #98be65;">"${sc} --color=auto"</span>;
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org729a6ac" class="outline-3">
<h3 id="org729a6ac">List Contents</h3>
<div class="outline-text-3" id="text-org729a6ac">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v <span style="color: #98be65;">"exa"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">ls</span>=<span style="color: #98be65;">"exa -Fh --color=auto"</span>;
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">la</span>=<span style="color: #98be65;">'exa -a --color=auto'</span>;
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">ll</span>=<span style="color: #98be65;">'exa -lr -s size'</span>;
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">lla</span>=<span style="color: #98be65;">'exa -a'</span>;
    <span style="color: #d76f10;">alias</span> l.=<span style="color: #98be65;">'exa -a --color=auto |grep "^\."'</span>;
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">sl</span>=<span style="color: #98be65;">"ls"</span>;
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab2d409" class="outline-3">
<h3 id="orgab2d409">neo visual editor improved</h3>
<div class="outline-text-3" id="text-orgab2d409">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v nvim &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">ex</span>=<span style="color: #98be65;">"nvim"</span>; <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">always open vim in normal mode</span>
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">vim</span>=<span style="color: #98be65;">"nvim"</span>; <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">always use neo</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa87844" class="outline-3">
<h3 id="orgaa87844">Container</h3>
<div class="outline-text-3" id="text-orgaa87844">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v podman &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
    <span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">docker</span>=<span style="color: #98be65;">"podman"</span>;  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Podman is drop-in replacement for docker</span>
    <span style="color: #d76f10;">alias</span> docker-compose=<span style="color: #98be65;">"podman-compose"</span>;  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Podman is drop-in replacement for docker</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>
</div>
