literate-config.org
** PATH
   #+BEGIN_SRC sh :tangle profile
     RUNCOMDIR="${HOME}/.runcom"
     export RUNCOMDIR
     # shellcheck source="bin"
     if [ -d "${HOME}/bin" ] ; then
         if [ "${PATH#*${HOME}/bin}" = "${PATH}" ]; then
             PATH="${HOME}/bin:${PATH}"
         fi
     fi
     # shellcheck source=".local/bin"
     if [ -d "${HOME}/.local/bin" ] ; then
         if [ "${PATH#*${HOME}/.local/bin}" = "${PATH}" ]; then
             PATH="${HOME}/.local/bin:${PATH}"
         fi
     fi
     export PATH;
   #+END_SRC

** Editor wars
   #+BEGIN_SRC sh :tangle profile
     while read -r avail; do
         if builtin command -v "${avail}" >/dev/null 2>&1; then
             EDITOR="${avail}"
         fi
     done << EOF
     nano
     vi
     vim
     nvim
     EOF
     export EDITOR

     case "$EDITOR" in
         vim)
             export MANPAGER='/bin/bash -c "vim -MRn -c \"set buftype=nofile showtabline=0 ft=man ts=8 nomod nolist norelativenumber nonu noma\" -c \"normal L\" -c \"nmap q :qa<CR>\"</dev/tty <(col -b)"'
             ;;
         nvim)
             export MANPAGER="nvim -c 'set ft=man' -"
             ;;
         ,*)
             export MANPAGER='bat -l man -p'
             ;;
     esac
     export MANPAGER
   #+END_SRC

** C(++) exports
   #+BEGIN_SRC sh :tangle profile
     LD_LIBRARY_PATH="${HOME}/.local/lib:${HOME}/.local/lib64";
     C_INCLUDE_PATH="${HOME}/.local/share/pspman/include/"
     CPLUS_INCLUDE_PATH="${HOME}/.local/share/pspman/include/"
     export LD_LIBRARY_PATH
     export C_INCLUDE_PATH
     export CPLUS_INCLUDE_PATH
   #+END_SRC

** GPU exports
   #+BEGIN_SRC sh :tangle profile
     PYOPENCL_CTX='0';
     PYOPENCL_COMPILER_OUTPUT=1;
     OCL_ICD_VENDORS="/etc/OpenCL/vendors/";
     export PYOPENCL_CTX
     export PYOPENCL_COMPILER_OUTPUT
     export OCL_ICD_VENDORS
   #+END_SRC

** Bemenu exports
   #+BEGIN_SRC sh :tangle shrc
     export BEMENU_OPTS='--fn firacode 14 '
   #+END_SRC

** GTK+ debugging output
   Silence debugging output for gtk+
   #+BEGIN_SRC sh :tangle profile
     NO_AT_BRIDGE=1
     export NO_AT_BRIDGE
   #+END_SRC

* Functions
** Python
*** Python version
    to locate site-packages

    #+BEGIN_SRC sh :tangle shrc
      python_ver() {
          python --version |cut -d "." -f1,2 |sed 's/ //' |sed 's/P/p/'
      }
    #+END_SRC

*** Quickly change to virtualenv
    Scan upto mountpoint, if any direct parent has .venv, source that ".venv/bin/activate"
    This may require shell-identification for ksh, csh, fish since they have a different activate
    #+BEGIN_SRC sh :tangle shrc
      to_venv () {
          test_d="$(realpath "${PWD}")"
          parents=16  # path too long to waste time
          until mountpoint "${test_d}" > /dev/null 2> /dev/null; do
              if [ $parents -le 0 ]; then
                  printf "Too many branch-nodes searched" >&2
                  unset parents
                  unset test_d
                  unset env_d
                  return 126
              fi
              for env_d in ".venv" "venv"; do
                  if [ -d "${test_d}/${env_d}" ] \
                         || [ -L "${test_d}/${env_d}" ]; then
                      # shellcheck disable=SC1090
                      . "${test_d}/${env_d}/bin/activate"
                      printf "Found %s, switching...\n" "${test_d}/${env_d}"
                      unset parents
                      unset test_d
                      unset env_d
                      return 0
                  fi
              done
              test_d="$(dirname "${test_d}")"
              parents=$((parents - 1))
          done
          printf "Couldn't find .venv upto mountpoint %s\n" "${test_d}" >&2
          unset parents
          unset test_d
          unset env_d
          return 126
      }
    #+END_SRC

