docs/literate-config.html

<div id="outline-container-org2c2eade" class="outline-2">
<h2 id="org2c2eade">Variables</h2>
<div class="outline-text-2" id="text-org2c2eade">
</div>
<div id="outline-container-orgec146b7" class="outline-3">
<h3 id="orgec146b7">PATH</h3>
<div class="outline-text-3" id="text-orgec146b7">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffffaf;">RUNCOMDIR</span>=<span style="color: #98be65;">"${HOME}/.runcom"</span>
<span style="color: #d76f10;">export</span> RUNCOMDIR
<span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source="bin"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -d <span style="color: #98be65;">"${HOME}/bin"</span> <span style="color: #51afef;">]</span> ; <span style="color: #51afef;">then</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> <span style="color: #98be65;">"${PATH#*${HOME}/bin}"</span> = <span style="color: #98be65;">"${PATH}"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">PATH</span>=<span style="color: #98be65;">"${HOME}/bin:${PATH}"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">fi</span>
<span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=".local/bin"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -d <span style="color: #98be65;">"${HOME}/.local/bin"</span> <span style="color: #51afef;">]</span> ; <span style="color: #51afef;">then</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> <span style="color: #98be65;">"${PATH#*${HOME}/.local/bin}"</span> = <span style="color: #98be65;">"${PATH}"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">PATH</span>=<span style="color: #98be65;">"${HOME}/.local/bin:${PATH}"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">fi</span>
<span style="color: #d76f10;">export</span> PATH;
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2169af" class="outline-3">
<h3 id="orge2169af">Editor wars</h3>
<div class="outline-text-3" id="text-orge2169af">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">while </span><span style="color: #d76f10;">read</span> -r avail; <span style="color: #51afef;">do</span>
    <span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v <span style="color: #98be65;">"${avail}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">EDITOR</span>=<span style="color: #98be65;">"${avail}"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">done</span> &lt;&lt; EOF
<span style="color: #98be65;">nano</span>
<span style="color: #98be65;">vi</span>
<span style="color: #98be65;">vim</span>
<span style="color: #98be65;">nvim</span>
<span style="color: #98be65;">EOF</span>
<span style="color: #d76f10;">export</span> EDITOR

<span style="color: #51afef;">case</span> <span style="color: #98be65;">"$EDITOR"</span><span style="color: #51afef;"> in</span>
    vim)
        <span style="color: #d76f10;">export</span> <span style="color: #ffffaf;">MANPAGER</span>=<span style="color: #98be65;">'/bin/bash -c "vim -MRn -c \"set buftype=nofile showtabline=0 ft=man ts=8 nomod nolist norelativenumber nonu noma\" -c \"normal L\" -c \"nmap q :qa&lt;CR&gt;\"&lt;/dev/tty &lt;(col -b)"'</span>
        ;;
    nvim)
        <span style="color: #d76f10;">export</span> <span style="color: #ffffaf;">MANPAGER</span>=<span style="color: #98be65;">"nvim -c 'set ft=man' -"</span>
        ;;
    *)
        <span style="color: #d76f10;">export</span> <span style="color: #ffffaf;">MANPAGER</span>=<span style="color: #98be65;">'bat -l man -p'</span>
        ;;
<span style="color: #51afef;">esac</span>
<span style="color: #d76f10;">export</span> MANPAGER
</pre>
</div>
</div>
</div>

<div id="outline-container-orga079923" class="outline-3">
<h3 id="orga079923">C(++) exports</h3>
<div class="outline-text-3" id="text-orga079923">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffffaf;">LD_LIBRARY_PATH</span>=<span style="color: #98be65;">"${HOME}/.local/lib:${HOME}/.local/lib64"</span>;
<span style="color: #ffffaf;">C_INCLUDE_PATH</span>=<span style="color: #98be65;">"${HOME}/.local/share/pspman/include/"</span>
<span style="color: #ffffaf;">CPLUS_INCLUDE_PATH</span>=<span style="color: #98be65;">"${HOME}/.local/share/pspman/include/"</span>
<span style="color: #d76f10;">export</span> LD_LIBRARY_PATH
<span style="color: #d76f10;">export</span> C_INCLUDE_PATH
<span style="color: #d76f10;">export</span> CPLUS_INCLUDE_PATH
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a740f5" class="outline-3">
<h3 id="org5a740f5">GPU exports</h3>
<div class="outline-text-3" id="text-org5a740f5">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffffaf;">PYOPENCL_CTX</span>=<span style="color: #98be65;">'0'</span>;
<span style="color: #ffffaf;">PYOPENCL_COMPILER_OUTPUT</span>=<span style="color: #da8548; font-weight: bold;">1</span>;
<span style="color: #ffffaf;">OCL_ICD_VENDORS</span>=<span style="color: #98be65;">"/etc/OpenCL/vendors/"</span>;
<span style="color: #d76f10;">export</span> PYOPENCL_CTX
<span style="color: #d76f10;">export</span> PYOPENCL_COMPILER_OUTPUT
<span style="color: #d76f10;">export</span> OCL_ICD_VENDORS
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7d68e6" class="outline-3">
<h3 id="orgb7d68e6">Bemenu exports</h3>
<div class="outline-text-3" id="text-orgb7d68e6">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">export</span> <span style="color: #ffffaf;">BEMENU_OPTS</span>=<span style="color: #98be65;">'--fn firacode 14 '</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c17fe4" class="outline-3">
<h3 id="org5c17fe4">GTK+ debugging output</h3>
<div class="outline-text-3" id="text-org5c17fe4">
<p>
Silence debugging output for gtk+
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffffaf;">NO_AT_BRIDGE</span>=<span style="color: #da8548; font-weight: bold;">1</span>
<span style="color: #d76f10;">export</span> NO_AT_BRIDGE
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org14d896a" class="outline-2">
<h2 id="org14d896a">Functions</h2>
<div class="outline-text-2" id="text-org14d896a">
</div>
<div id="outline-container-orgda1b479" class="outline-3">
<h3 id="orgda1b479">Python</h3>
<div class="outline-text-3" id="text-orgda1b479">
</div>
<div id="outline-container-org1cface7" class="outline-4">
<h4 id="org1cface7">Python version</h4>
<div class="outline-text-4" id="text-org1cface7">
<p>
to locate site-packages
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">python_ver</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    python --version |cut -d <span style="color: #98be65;">"."</span> -f1,2 |sed <span style="color: #98be65;">'s/ //'</span> |sed <span style="color: #98be65;">'s/P/p/'</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4c8dd4e" class="outline-4">
<h4 id="org4c8dd4e">Quickly change to virtualenv</h4>
<div class="outline-text-4" id="text-org4c8dd4e">
<p>
Scan upto mountpoint, if any direct parent has .venv, source that ".venv/bin/activate"
This may require shell-identification for ksh, csh, fish since they have a different activate
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">to_venv</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">test_d</span>=<span style="color: #98be65;">"$(realpath "${PWD}")"</span>
    <span style="color: #ffffaf;">parents</span>=<span style="color: #da8548; font-weight: bold;">16</span>  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">path too long to waste time</span>
    <span style="color: #51afef;">until</span> mountpoint <span style="color: #98be65;">"${test_d}"</span> &gt; /dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt; /dev/null; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">parents</span> -le <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            printf <span style="color: #98be65;">"Too many branch-nodes searched"</span> &gt;&amp;<span style="color: #da8548; font-weight: bold;">2</span>
            <span style="color: #d76f10;">unset</span> parents
            <span style="color: #d76f10;">unset</span> test_d
            <span style="color: #d76f10;">unset</span> env_d
            <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">126</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #51afef;">for</span> env_d<span style="color: #51afef;"> in</span> <span style="color: #98be65;">".venv"</span> <span style="color: #98be65;">"venv"</span>; <span style="color: #51afef;">do</span>
            <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -d <span style="color: #98be65;">"${test_d}/${env_d}"</span> <span style="color: #c678dd;">]</span> <span style="color: #98be65;">\</span>
                   || <span style="color: #c678dd;">[</span> -L <span style="color: #98be65;">"${test_d}/${env_d}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC1090</span>
                . <span style="color: #98be65;">"${test_d}/${env_d}/bin/activate"</span>
                printf <span style="color: #98be65;">"Found %s, switching...\n"</span> <span style="color: #98be65;">"${test_d}/${env_d}"</span>
                <span style="color: #d76f10;">unset</span> parents
                <span style="color: #d76f10;">unset</span> test_d
                <span style="color: #d76f10;">unset</span> env_d
                <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>
            <span style="color: #51afef;">fi</span>
        <span style="color: #51afef;">done</span>
        <span style="color: #ffffaf;">test_d</span>=<span style="color: #98be65;">"$(dirname "${test_d}")"</span>
        <span style="color: #ffffaf;">parents</span>=$<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>parents - <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
    <span style="color: #51afef;">done</span>
    printf <span style="color: #98be65;">"Couldn't find .venv upto mountpoint %s\n"</span> <span style="color: #98be65;">"${test_d}"</span> &gt;&amp;<span style="color: #da8548; font-weight: bold;">2</span>
    <span style="color: #d76f10;">unset</span> parents
    <span style="color: #d76f10;">unset</span> test_d
    <span style="color: #d76f10;">unset</span> env_d
    <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">126</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
