literate-config.org
*** Virtualenv in prompt string
    #+BEGIN_SRC sh :tangle shrc
      _show_venv () {
          # if a virtualenv is active, print it's name
          if [ -n "${VIRTUAL_ENV}" ]; then
              base="$(basename "${VIRTUAL_ENV}")"
              if [ "${base}" = ".venv" ] || [ "${base}" = "venv"  ]; then
                  printf "/%s" "$(basename "$(dirname "${VIRTUAL_ENV}")")"
                  unset base
              else
                  printf "/%s" "${base}"
                  unset base
              fi
          fi
      }
    #+END_SRC
** Git
*** Status
    #+BEGIN_SRC sh :tangle shrc
      git_status() {
          modified=0
          cached=0
          untracked=0

          while read -r line; do
              case "${line}" in
                  _*_\ _)
                      cached=1
                      ;;
                  _\ _*_)
                      modified=1
                      ;;
                  _?_?_)
                      untracked=1
                      ;;
              esac
          done << endstat
      $(git status --short | cut -b -2 | sed -e 's/\(.\)\(.*\)/_\1_\2_/')
      endstat

          stat_str=''
          if [ $modified -ne 0 ]; then
              stat_str="${stat_str}\033[0;31m\ue728"
          fi

          if [ $cached -ne 0 ]; then
              stat_str="${stat_str}\033[0;32m\ue729"
          fi

          if [ $untracked -ne 0 ]; then
              stat_str="${stat_str}\033[0;31m\uf476"
          fi

          if [ -n "$(git stash list)" ]; then
              stat_str="${stat_str}\e[0;36m\uf48e"
          fi
          if [ -n "${stat_str}" ]; then
              # shellcheck disable=SC2059  # I do want escape characters
              printf "${stat_str}\e[m"
          fi
          unset modified
          unset cached
          unset untracked
      }
    #+END_SRC

*** Branch
    #+BEGIN_SRC sh :tangle shrc
      #!/usr/bin/env sh
      # -*- coding: utf-8; mode: shell-script; -*-


      git_branch() {
          branch_str=''
          branch="$(git branch 2>/dev/null | grep '^\*' | sed -e 's/^* //')"
          if [ -n "${branch}" ]; then
              case "${branch}" in
                  feat-*)
                      branch_str="${branch_str}\033[0;32m"
                      ;;
                  bug-*)
                      branch_str="${branch_str}\033[0;31m"
                      ;;
                  act-*)
                      branch_str="${branch_str}\e[0;36m"
                      ;;
                  tmp-*)
                      branch_str="${branch_str}\e[0;36m"
                      ;;
                  ,*HEAD\ detached*)
                      branch_str="${branch_str}\e[0;33m"
                      ;;
                  master)
                      unset branch
                      unset branch_str
                      return
                      ;;
                  ,*)
                      branch_str="${branch_str}\e[0;35m"
                      ;;
              esac
          fi
          printf "${branch_str}%s\ue725\e[m" "${branch}"
          unset branch_str
          unset branch
      }

    #+END_SRC
*** Hash
    #+BEGIN_SRC sh :tangle shrc
      git_hash() {
          git log --pretty=format:'%h' -n 1
      }
    #+END_SRC

*** Prompt string
    Include git's branch, hash, status in PS1 if in git repository
    This function is called in PS1 section below
    #+NAME: Git PS
    #+BEGIN_SRC sh :tangle shrc
      git_ps() {
          if ! git status --ignore-submodules >/dev/null 2>&1; then
              return
          else
              printf " %s%s%s " "$(git_branch)" "$(git_hash)" "$(git_status)"
          fi
      }
    #+END_SRC

** Prompt String
