docs/literate-config.html

<div id="outline-container-org527ce7b" class="outline-4">
<h4 id="org527ce7b">Virtualenv in prompt string</h4>
<div class="outline-text-4" id="text-org527ce7b">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">_show_venv</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">if a virtualenv is active, print it's name</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${VIRTUAL_ENV}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">base</span>=<span style="color: #98be65;">"$(basename "${VIRTUAL_ENV}")"</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${base}"</span> = <span style="color: #98be65;">".venv"</span> <span style="color: #c678dd;">]</span> || <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${base}"</span> = <span style="color: #98be65;">"venv"</span>  <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            printf <span style="color: #98be65;">"/%s"</span> <span style="color: #98be65;">"$(basename "$(dirname "${VIRTUAL_ENV}")")"</span>
            <span style="color: #d76f10;">unset</span> base
        <span style="color: #51afef;">else</span>
            printf <span style="color: #98be65;">"/%s"</span> <span style="color: #98be65;">"${base}"</span>
            <span style="color: #d76f10;">unset</span> base
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org672c4fd" class="outline-3">
<h3 id="org672c4fd">Git</h3>
<div class="outline-text-3" id="text-org672c4fd">
</div>
<div id="outline-container-org5543f0c" class="outline-4">
<h4 id="org5543f0c">Status</h4>
<div class="outline-text-4" id="text-org5543f0c">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">git_status</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">modified</span>=<span style="color: #da8548; font-weight: bold;">0</span>
    <span style="color: #ffffaf;">cached</span>=<span style="color: #da8548; font-weight: bold;">0</span>
    <span style="color: #ffffaf;">untracked</span>=<span style="color: #da8548; font-weight: bold;">0</span>

    <span style="color: #51afef;">while </span><span style="color: #d76f10;">read</span> -r line; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">case</span> <span style="color: #98be65;">"${line}"</span><span style="color: #51afef;"> in</span>
            _*_<span style="color: #98be65;">\ </span>_)
                <span style="color: #ffffaf;">cached</span>=<span style="color: #da8548; font-weight: bold;">1</span>
                ;;
            _<span style="color: #98be65;">\ </span>_*_)
                <span style="color: #ffffaf;">modified</span>=<span style="color: #da8548; font-weight: bold;">1</span>
                ;;
            _?_?_)
                <span style="color: #ffffaf;">untracked</span>=<span style="color: #da8548; font-weight: bold;">1</span>
                ;;
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">done</span> &lt;&lt; endstat
<span style="color: #98be65;">$(git status --short | cut -b -2 | sed -e 's/\(.\)\(.*\)/_\1_\2_/')</span>
<span style="color: #98be65;">endstat</span>

    <span style="color: #ffffaf;">stat_str</span>=<span style="color: #98be65;">''</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">modified</span> -ne <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">stat_str</span>=<span style="color: #98be65;">"${stat_str}</span><span style="color: #ffffff; background-color: #A93F43;">\033[0;31m</span><span style="color: #98be65;">\ue728"</span>
    <span style="color: #51afef;">fi</span>

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">cached</span> -ne <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">stat_str</span>=<span style="color: #98be65;">"${stat_str}</span><span style="color: #000000; background-color: #59963A;">\033[0;32m</span><span style="color: #98be65;">\ue729"</span>
    <span style="color: #51afef;">fi</span>

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">untracked</span> -ne <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">stat_str</span>=<span style="color: #98be65;">"${stat_str}</span><span style="color: #ffffff; background-color: #A93F43;">\033[0;31m</span><span style="color: #98be65;">\uf476"</span>
    <span style="color: #51afef;">fi</span>

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"$(git stash list)"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">stat_str</span>=<span style="color: #98be65;">"${stat_str}</span><span style="color: #000000; background-color: #4E9B9B;">\e[0;36m</span><span style="color: #98be65;">\uf48e"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${stat_str}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059  # I do want escape characters</span>
        printf <span style="color: #98be65;">"${stat_str}\e[m"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #d76f10;">unset</span> modified
    <span style="color: #d76f10;">unset</span> cached
    <span style="color: #d76f10;">unset</span> untracked
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org165370f" class="outline-4">
<h4 id="org165370f">Branch</h4>
<div class="outline-text-4" id="text-org165370f">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #3f4f5f; background-color: #0f0f0f;"> sh</span>
<span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">-*- coding: utf-8; mode: shell-script; -*-</span>


<span style="color: #9f5f9f; font-weight: bold;">git_branch</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">branch_str</span>=<span style="color: #98be65;">''</span>
    <span style="color: #ffffaf;">branch</span>=<span style="color: #98be65;">"$(git branch 2&gt;/dev/null | grep '^\*' | sed -e 's/^* //')"</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${branch}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">case</span> <span style="color: #98be65;">"${branch}"</span><span style="color: #51afef;"> in</span>
            feat-*)
                <span style="color: #ffffaf;">branch_str</span>=<span style="color: #98be65;">"${branch_str}</span><span style="color: #000000; background-color: #59963A;">\033[0;32m</span><span style="color: #98be65;">"</span>
                ;;
            bug-*)
                <span style="color: #ffffaf;">branch_str</span>=<span style="color: #98be65;">"${branch_str}</span><span style="color: #ffffff; background-color: #A93F43;">\033[0;31m</span><span style="color: #98be65;">"</span>
                ;;
            act-*)
                <span style="color: #ffffaf;">branch_str</span>=<span style="color: #98be65;">"${branch_str}</span><span style="color: #000000; background-color: #4E9B9B;">\e[0;36m</span><span style="color: #98be65;">"</span>
                ;;
            tmp-*)
                <span style="color: #ffffaf;">branch_str</span>=<span style="color: #98be65;">"${branch_str}</span><span style="color: #000000; background-color: #4E9B9B;">\e[0;36m</span><span style="color: #98be65;">"</span>
                ;;
            *HEAD<span style="color: #98be65;">\ </span>detached*)
                <span style="color: #ffffaf;">branch_str</span>=<span style="color: #98be65;">"${branch_str}</span><span style="color: #000000; background-color: #BE8A2D;">\e[0;33m</span><span style="color: #98be65;">"</span>
                ;;
            master)
                <span style="color: #d76f10;">unset</span> branch
                <span style="color: #d76f10;">unset</span> branch_str
                <span style="color: #51afef;">return</span>
                ;;
            *)
                <span style="color: #ffffaf;">branch_str</span>=<span style="color: #98be65;">"${branch_str}</span><span style="color: #ffffff; background-color: #7F60A7;">\e[0;35m</span><span style="color: #98be65;">"</span>
                ;;
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">fi</span>
    printf <span style="color: #98be65;">"${branch_str}%s\ue725\e[m"</span> <span style="color: #98be65;">"${branch}"</span>
    <span style="color: #d76f10;">unset</span> branch_str
    <span style="color: #d76f10;">unset</span> branch
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org7aaa16e" class="outline-4">
<h4 id="org7aaa16e">Hash</h4>
<div class="outline-text-4" id="text-org7aaa16e">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">git_hash</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    git log --pretty=format:<span style="color: #98be65;">'%h'</span> -n <span style="color: #da8548; font-weight: bold;">1</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3c9d01" class="outline-4">
<h4 id="orgb3c9d01">Prompt string</h4>
<div class="outline-text-4" id="text-orgb3c9d01">
<p>
Include git's branch, hash, status in PS1 if in git repository
This function is called in PS1 section below
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orgb6163a5"><span style="color: #9f5f9f; font-weight: bold;">git_ps</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef; font-weight: bold;">!</span> git status --ignore-submodules &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">return</span>
    <span style="color: #51afef;">else</span>
        printf <span style="color: #98be65;">" %s%s%s "</span> <span style="color: #98be65;">"$(git_branch)"</span> <span style="color: #98be65;">"$(git_hash)"</span> <span style="color: #98be65;">"$(git_status)"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>
