literate-config.org
*** Exit_color
    #+BEGIN_SRC sh :tangle shrc
      last_exit_color () {
          err="$1"
          if [ "$err"  = "0" ]; then
              # no error
              printf "\e[0;32m"
          elif [ "$err"  = "1" ]; then
              # general error
              printf "\e[0;33m"
          elif [ "$err"  = "2" ]; then
              # misuse of shell builtins
              printf "\e[0;31m"
          elif [ "$err" -gt "63" ] && [ "$err" -lt "84" ]; then
              # syserror.h
              printf "\e[0;91m"
          elif [ "$err"  = "126" ]; then
              # cannot execute
              printf "\e[0;37m"
          elif [ "$err"  = "127" ]; then
              # command not found
              printf "\e[0;30m"
          elif [ "$err" -gt "127" ] && [ "$err" -lt "191" ]; then
              # Fatal error
              printf "\e[0;41m"
          elif [ "$err"  = "255" ]; then
              # exit status limit
              printf "\e[0;31m"
          else
              printf "\e[0;31m"
          fi
          unset err
      }
    #+END_SRC

*** PROMPT_COMMAND
**** bash
     #+BEGIN_SRC bash :tangle bashrc
       export PROMPT_COMMAND=__prompt_command
       __prompt_command () {
           exit_stat="$?"
           PS1=""
           PS1+="\[\$(last_exit_color ${exit_stat})\]┏━ \[\e[m\]"
           PS1+="\[\e[0;32m\]\u\[\e[m\]"
           PS1+="\[\e[3;35m\]\$(_show_venv)\[\e[m\]"
           PS1+="@"
           PS1+="\[\e[0;34m\]\h\[\e[m\]"
           PS1+="\$(git_ps)"
           PS1+="\[\e[0;37m\]<"
           PS1+="\[\e[0;36m\]\W"
           PS1+="\[\e[0;37m\]>"
           PS1+="\[\e[0;33m\]\t\[\e[m\]"
           PS1+="\n\[\$(last_exit_color ${exit_stat})\]┗━ \[\e[m\]"

           PS2=""
           PS2+="\[\e[0;36m\]cont..."
           PS2+="\[\e[m\]"
           PS2+="» ";

           PS3='Selection: ';
       }
     #+END_SRC

**** zsh
     #+BEGIN_SRC bash :tangle zshrc
       _pspps () {
           exit_stat="$?"
           PS1=$''
           PS1+="%{$(last_exit_color ${exit_stat})%}"
           PS1+=$'┏━ \e[m'
           PS1+=$'%{\e[0;32m%}%n%{\e[m%}'
           PS1+=$'%{\e[3;35m%}'
           PS1+="$(_show_venv)"
           PS1+=$'%{\e[m%}'
           PS1+=$'@'
           PS1+=$'%{\e[0;34m%}%m%{\e[m%}'
           PS1+="$(git_ps)"
           PS1+=$'%{\e[0;37m%}<'
           PS1+=$'%{\e[0;36m%}%1~'
           PS1+=$'%{\e[0;37m%}>'
           PS1+=$'%{\e[0;33m%}%*%{\e[m%}\n'
           PS1+="%{$(last_exit_color ${exit_stat})%}"
           PS1+=$'┗━ %{\e[m%}'

           PS2=$''
           PS2+=$'%{\e[0;36m%}cont...'
           PS2+=$'%{\e[m%}'
           PS2+=$'» ';

           PS3='Selection: ';
       }

       add-zsh-hook precmd _pspps

     #+END_SRC

** Mathematical
