docs/literate-config.html

<div id="outline-container-org0c257dc" class="outline-3">
<h3 id="org0c257dc">Prompt String</h3>
<div class="outline-text-3" id="text-org0c257dc">
</div>
<div id="outline-container-org0e11b5e" class="outline-4">
<h4 id="org0e11b5e">Exit_color</h4>
<div class="outline-text-4" id="text-org0e11b5e">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">last_exit_color</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">err</span>=<span style="color: #98be65;">"$1"</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span>  = <span style="color: #98be65;">"0"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">no error</span>
        printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #59963A;">\e[0;32m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span>  = <span style="color: #98be65;">"1"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">general error</span>
        printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #BE8A2D;">\e[0;33m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span>  = <span style="color: #98be65;">"2"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">misuse of shell builtins</span>
        printf <span style="color: #98be65;">"</span><span style="color: #ffffff; background-color: #A93F43;">\e[0;31m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span> -gt <span style="color: #98be65;">"63"</span> <span style="color: #c678dd;">]</span> &amp;&amp; <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span> -lt <span style="color: #98be65;">"84"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">syserror.h</span>
        printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #EC6261;">\e[0;91m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span>  = <span style="color: #98be65;">"126"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">cannot execute</span>
        printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #7E8A90;">\e[0;37m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span>  = <span style="color: #98be65;">"127"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">command not found</span>
        printf <span style="color: #98be65;">"</span><span style="color: #ffffff; background-color: #192033;">\e[0;30m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span> -gt <span style="color: #98be65;">"127"</span> <span style="color: #c678dd;">]</span> &amp;&amp; <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span> -lt <span style="color: #98be65;">"191"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Fatal error</span>
        printf <span style="color: #98be65;">"</span><span style="color: #ffffff; background-color: #A93F43;">\e[0;41m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">elif</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$err"</span>  = <span style="color: #98be65;">"255"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">exit status limit</span>
        printf <span style="color: #98be65;">"</span><span style="color: #ffffff; background-color: #A93F43;">\e[0;31m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">else</span>
        printf <span style="color: #98be65;">"</span><span style="color: #ffffff; background-color: #A93F43;">\e[0;31m</span><span style="color: #98be65;">"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #d76f10;">unset</span> err
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org50c705d" class="outline-4">
<h4 id="org50c705d">PROMPT_COMMAND</h4>
<div class="outline-text-4" id="text-org50c705d">
</div>
<ul class="org-ul">
<li><a id="orgb70d430"></a>bash<br />
<div class="outline-text-5" id="text-orgb70d430">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #d76f10;">export</span> <span style="color: #ffffaf;">PROMPT_COMMAND</span>=__prompt_command
<span style="color: #9f5f9f; font-weight: bold;">__prompt_command</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">exit_stat</span>=<span style="color: #98be65;">"$?"</span>
    <span style="color: #ffffaf;">PS1</span>=<span style="color: #98be65;">""</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[\$(last_exit_color ${exit_stat})\]&#9487;&#9473; \[\e[m\]"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[</span><span style="color: #000000; background-color: #59963A;">\e[0;32m</span><span style="color: #98be65;">\]\u\[\e[m\]"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[\e[3;35m\]\$(_show_venv)\[\e[m\]"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"@"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[</span><span style="color: #ffffff; background-color: #4068A3;">\e[0;34m</span><span style="color: #98be65;">\]\h\[\e[m\]"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\$(git_ps)"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[</span><span style="color: #000000; background-color: #7E8A90;">\e[0;37m</span><span style="color: #98be65;">\]&lt;"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[</span><span style="color: #000000; background-color: #4E9B9B;">\e[0;36m</span><span style="color: #98be65;">\]\W"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[</span><span style="color: #000000; background-color: #7E8A90;">\e[0;37m</span><span style="color: #98be65;">\]&gt;"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\[</span><span style="color: #000000; background-color: #BE8A2D;">\e[0;33m</span><span style="color: #98be65;">\]\t\[\e[m\]"</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"\n\[\$(last_exit_color ${exit_stat})\]&#9495;&#9473; \[\e[m\]"</span>

    <span style="color: #ffffaf;">PS2</span>=<span style="color: #98be65;">""</span>
    <span style="color: #ffffaf;">PS2</span>+=<span style="color: #98be65;">"\[</span><span style="color: #000000; background-color: #4E9B9B;">\e[0;36m</span><span style="color: #98be65;">\]cont..."</span>
    <span style="color: #ffffaf;">PS2</span>+=<span style="color: #98be65;">"\[\e[m\]"</span>
    <span style="color: #ffffaf;">PS2</span>+=<span style="color: #98be65;">"&#187; "</span>;

    <span style="color: #ffffaf;">PS3</span>=<span style="color: #98be65;">'Selection: '</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org90005cc"></a>zsh<br />
<div class="outline-text-5" id="text-org90005cc">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #9f5f9f; font-weight: bold;">_pspps</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">exit_stat</span>=<span style="color: #98be65;">"$?"</span>
    <span style="color: #ffffaf;">PS1</span>=$<span style="color: #98be65;">''</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"%{$(last_exit_color ${exit_stat})%}"</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'&#9487;&#9473; \e[m'</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{</span><span style="color: #000000; background-color: #59963A;">\e[0;32m</span><span style="color: #98be65;">%}%n%{\e[m%}'</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{\e[3;35m%}'</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"$(_show_venv)"</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{\e[m%}'</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'@'</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{</span><span style="color: #ffffff; background-color: #4068A3;">\e[0;34m</span><span style="color: #98be65;">%}%m%{\e[m%}'</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"$(git_ps)"</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{</span><span style="color: #000000; background-color: #7E8A90;">\e[0;37m</span><span style="color: #98be65;">%}&lt;'</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{</span><span style="color: #000000; background-color: #4E9B9B;">\e[0;36m</span><span style="color: #98be65;">%}%1~'</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{</span><span style="color: #000000; background-color: #7E8A90;">\e[0;37m</span><span style="color: #98be65;">%}&gt;'</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'%{</span><span style="color: #000000; background-color: #BE8A2D;">\e[0;33m</span><span style="color: #98be65;">%}%*%{\e[m%}\n'</span>
    <span style="color: #ffffaf;">PS1</span>+=<span style="color: #98be65;">"%{$(last_exit_color ${exit_stat})%}"</span>
    <span style="color: #ffffaf;">PS1</span>+=$<span style="color: #98be65;">'&#9495;&#9473; %{\e[m%}'</span>

    <span style="color: #ffffaf;">PS2</span>=$<span style="color: #98be65;">''</span>
    <span style="color: #ffffaf;">PS2</span>+=$<span style="color: #98be65;">'%{</span><span style="color: #000000; background-color: #4E9B9B;">\e[0;36m</span><span style="color: #98be65;">%}cont...'</span>
    <span style="color: #ffffaf;">PS2</span>+=$<span style="color: #98be65;">'%{\e[m%}'</span>
    <span style="color: #ffffaf;">PS2</span>+=$<span style="color: #98be65;">'&#187; '</span>;

    <span style="color: #ffffaf;">PS3</span>=<span style="color: #98be65;">'Selection: '</span>;
<span style="color: #51afef;">}</span>

add-zsh-hook precmd _pspps

</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
