literate-config.org
*** In-Line Calculator
    #+BEGIN_SRC sh :tangle shrc
      mathcalc() {
          echo "$*"| bc -lq
      }
    #+END_SRC

*** Computational
    #+BEGIN_SRC sh :tangle shrc
      dec2hex() {
          echo "hex:"
          echo "obase=16; $*"| bc
          echo "dec:"
          echo "ibase=16; $*"| bc
      }
    #+END_SRC

** Compilation
*** PDF from Latex
    #+BEGIN_SRC sh :tangle shrc
      pdfcompile() {
          pdflatex "$1"
          for ext in ".toc" ".log" ".aux"; do
              [ -f "${1%.tex}${ext}" ] && rm "${1%.tex}${ext}"
          done
          evince "${1%.tex}.pdf"
      }
    #+END_SRC
*** Pandoc
**** Org to Something
     #+BEGIN_SRC sh :tangle shrc
       org2export() {
           # Usage: org2oth [-f] <infile> <othtype>
           proceed=
           while test $# -gt 1; do
               case "$1" in
                   -f|--force)
                       proceed=true
                       shift 1
                       ;;
                   ,*)
                       infile="${1}"
                       shift 1
                       ;;
               esac
           done
           if [ "${1}" = "pdf" ]; then
               target="latex"
           else
               target="${1}"
           fi
           case "$infile" in
               ,*.org)
                   proceed=true
                   ;;
               ,*)
                   echo "Input file should be an org file"
                   ;;
           esac
           if [ -n "$proceed" ]; then
               pandoc -f org -t "${target}" -o "${infile%.*}.${1}" "$infile"
           fi
           unset proceed
           unset target
           unset infile
       }
     #+END_SRC

**** Org to Docx
     #+BEGIN_SRC sh :tangle shrc
       org2doc () {
           org2export "$@" "docx"
       }
     #+END_SRC

**** Org to PDF
     #+BEGIN_SRC sh :tangle shrc
       org2pdf () {
           org2export "$@" "pdf"
       }
     #+END_SRC

**** Docx to Org
     #+BEGIN_SRC sh :tangle shrc
       doc2org() {
           case "${1}" in
               ,*.docx)
                   pandoc -f docx -t org -o "${1%.docx}.org" "$1"
                   ;;
               ,*)
                   echo "Input file must be a docx file"
                   ;;
           esac
       }
     #+END_SRC

** Mount Home Server
   Home Cloud mounts
   #+BEGIN_SRC sh :tangle shrc
     mount_home_cloud() {
         # shellcheck disable=SC2154
         if [ -z "${home_cloud}" ] || [ -z "${cloud_user}" ]; then
             echo "variables \$home_cloud OR \$cloud_user haven't been defined"
             return
         fi
         # netcheck source=./netcheck.sh
         IFS="$(printf '\t')" read -r IP_ADDR AP_ADDR netstate << netcheck
     $("${RUNCOMDIR}"/netcheck.sh)
     netcheck
         if [ $(( netstate % 4 )) -eq 2 ]; then
             srv_mnt_dir="${HOME}/${home_cloud}"

             set -- "/media/data" "/home/${cloud_user}"
             if [ "$(mount | grep -c "${srv_mnt_dir}")" -lt "$#" ]; then
                 # not mounted
                 while [ $# -gt 0 ]; do
                     mkdir -p "${srv_mnt_dir}${1}"
                     sshfs -o \
                           "reconnect,ServerAliveInterval=15,ServerAliveCountMax=3" \
                           "${cloud_user}@${home_cloud}:${1}" "${srv_mnt_dir}${1}"
                     shift
                 done
             fi
         fi
         unset srv_mnt_dir
     }

   #+END_SRC

