docs/literate-config.html

<div id="outline-container-org7d6d985" class="outline-3">
<h3 id="org7d6d985">Mathematical</h3>
<div class="outline-text-3" id="text-org7d6d985">
</div>
<div id="outline-container-org80c094e" class="outline-4">
<h4 id="org80c094e">In-Line Calculator</h4>
<div class="outline-text-4" id="text-org80c094e">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">mathcalc</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"$*"</span>| bc -lq
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca43393" class="outline-4">
<h4 id="orgca43393">Computational</h4>
<div class="outline-text-4" id="text-orgca43393">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">dec2hex</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"hex:"</span>
    <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"obase=16; $*"</span>| bc
    <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"dec:"</span>
    <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"ibase=16; $*"</span>| bc
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgea9bcba" class="outline-3">
<h3 id="orgea9bcba">Compilation</h3>
<div class="outline-text-3" id="text-orgea9bcba">
</div>
<div id="outline-container-org36325ca" class="outline-4">
<h4 id="org36325ca">PDF from Latex</h4>
<div class="outline-text-4" id="text-org36325ca">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">pdfcompile</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    pdflatex <span style="color: #98be65;">"$1"</span>
    <span style="color: #51afef;">for</span> ext<span style="color: #51afef;"> in</span> <span style="color: #98be65;">".toc"</span> <span style="color: #98be65;">".log"</span> <span style="color: #98be65;">".aux"</span>; <span style="color: #51afef;">do</span>
        <span style="color: #c678dd;">[</span> -f <span style="color: #98be65;">"${1%.tex}${ext}"</span> <span style="color: #c678dd;">]</span> &amp;&amp; rm <span style="color: #98be65;">"${1%.tex}${ext}"</span>
    <span style="color: #51afef;">done</span>
    evince <span style="color: #98be65;">"${1%.tex}.pdf"</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e61da9" class="outline-4">
<h4 id="org2e61da9">Pandoc</h4>
<div class="outline-text-4" id="text-org2e61da9">
</div>
<ul class="org-ul">
<li><a id="org01af958"></a>Org to Something<br />
<div class="outline-text-5" id="text-org01af958">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">org2export</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Usage: org2oth [-f] &lt;infile&gt; &lt;othtype&gt;</span>
    <span style="color: #ffffaf;">proceed</span>=
    <span style="color: #51afef;">while</span> test $<span style="color: #ffffaf;">#</span> -gt <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">case</span> <span style="color: #98be65;">"$1"</span><span style="color: #51afef;"> in</span>
            -f|--force)
                <span style="color: #ffffaf;">proceed</span>=true
                <span style="color: #d76f10;">shift</span> <span style="color: #da8548; font-weight: bold;">1</span>
                ;;
            *)
                <span style="color: #ffffaf;">infile</span>=<span style="color: #98be65;">"${1}"</span>
                <span style="color: #d76f10;">shift</span> <span style="color: #da8548; font-weight: bold;">1</span>
                ;;
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">done</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${1}"</span> = <span style="color: #98be65;">"pdf"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">target</span>=<span style="color: #98be65;">"latex"</span>
    <span style="color: #51afef;">else</span>
        <span style="color: #ffffaf;">target</span>=<span style="color: #98be65;">"${1}"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">case</span> <span style="color: #98be65;">"$infile"</span><span style="color: #51afef;"> in</span>
        *.org)
            <span style="color: #ffffaf;">proceed</span>=true
            ;;
        *)
            <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"Input file should be an org file"</span>
            ;;
    <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"$proceed"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        pandoc -f org -t <span style="color: #98be65;">"${target}"</span> -o <span style="color: #98be65;">"${infile%.*}.${1}"</span> <span style="color: #98be65;">"$infile"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #d76f10;">unset</span> proceed
    <span style="color: #d76f10;">unset</span> target
    <span style="color: #d76f10;">unset</span> infile
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd103cbe"></a>Org to Docx<br />
<div class="outline-text-5" id="text-orgd103cbe">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">org2doc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    org2export <span style="color: #98be65;">"$@"</span> <span style="color: #98be65;">"docx"</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orga7b1146"></a>Org to PDF<br />
<div class="outline-text-5" id="text-orga7b1146">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">org2pdf</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    org2export <span style="color: #98be65;">"$@"</span> <span style="color: #98be65;">"pdf"</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orgb18069d"></a>Docx to Org<br />
<div class="outline-text-5" id="text-orgb18069d">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">doc2org</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">case</span> <span style="color: #98be65;">"${1}"</span><span style="color: #51afef;"> in</span>
        *.docx)
            pandoc -f docx -t org -o <span style="color: #98be65;">"${1%.docx}.org"</span> <span style="color: #98be65;">"$1"</span>
            ;;
        *)
            <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"Input file must be a docx file"</span>
            ;;
    <span style="color: #51afef;">esac</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6c2e27e" class="outline-3">
<h3 id="org6c2e27e">Mount Home Server</h3>
<div class="outline-text-3" id="text-org6c2e27e">
<p>
Home Cloud mounts
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">mount_home_cloud</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2154</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${home_cloud}"</span> <span style="color: #c678dd;">]</span> || <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${cloud_user}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"variables \$home_cloud OR \$cloud_user haven't been defined"</span>
        <span style="color: #51afef;">return</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">netcheck source=./netcheck.sh</span>
    <span style="color: #ffffaf;">IFS</span>=<span style="color: #98be65;">"$(printf '\t')"</span> read -r IP_ADDR AP_ADDR netstate &lt;&lt; netcheck
<span style="color: #98be65;">$("${RUNCOMDIR}"/netcheck.sh)</span>
<span style="color: #98be65;">netcheck</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> $<span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span> netstate % <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span> -eq <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">srv_mnt_dir</span>=<span style="color: #98be65;">"${HOME}/${home_cloud}"</span>

        <span style="color: #d76f10;">set</span> -- <span style="color: #98be65;">"/media/data"</span> <span style="color: #98be65;">"/home/${cloud_user}"</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$(mount | grep -c "${srv_mnt_dir}")"</span> -lt <span style="color: #98be65;">"$#"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">not mounted</span>
            <span style="color: #51afef;">while</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">#</span> -gt <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">do</span>
                mkdir -p <span style="color: #98be65;">"${srv_mnt_dir}${1}"</span>
                sshfs -o <span style="color: #98be65;">\</span>
                      <span style="color: #98be65;">"reconnect,ServerAliveInterval=15,ServerAliveCountMax=3"</span> <span style="color: #98be65;">\</span>
                      <span style="color: #98be65;">"${cloud_user}@${home_cloud}:${1}"</span> <span style="color: #98be65;">"${srv_mnt_dir}${1}"</span>
                <span style="color: #d76f10;">shift</span>
            <span style="color: #51afef;">done</span>
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #d76f10;">unset</span> srv_mnt_dir
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>
