literate-config.org
** Launch gui
   Launch application and exit terminal window
   Acts like a launcher
   Uninteractive terminal commands may also be called
   #+BEGIN_SRC sh :tangle shrc
     gui () {
         usage="usage: $0 [-h|--help] CMD\n"
         cmd_help="Launch CMD, switch to it, and exit the parent terminal\n\n"
         cmd_help="${cmd_help}Optional arguments:\n"
         cmd_help="${cmd_help}-h|--help\tdisplay this help and exit\n"
         cmd=
         call=

         while [ $# -gt 0 ]; do
             case "$1" in
                 --help|-h)
                     printf "%s""${usage}"
                     printf "%s""${cmd_help}"
                     shift 1
                     unset cmd
                     unset cmd_help
                     unset usage
                     unset call
                     return 0
                     ;;
                 --)
                     # end of gui arguments
                     cmd="${cmd} $*"
                     break
                     ;;
                 ,*)
                     cmd="${1}"
                     shift 1
                     ;;
             esac
         done

         call="$(echo "${cmd}" | cut -d " " -f 1)"
         if [ -n "${call}" ]; then
             if builtin command -v "${call}" >/dev/null 2>&1; then
                 unset cmd_help
                 unset usage
                 unset call
                 nohup "${cmd}" >/dev/null 0<&- 2>&1 & exit 0
             else
                 echo "${call} not found..."
                 unset cmd
                 unset cmd_help
                 unset usage
                 unset call
                 return 127
             fi
         else
             printf "%s""${usage}"
             unset cmd
             unset cmd_help
             unset usage
             unset call
             return 1
         fi

     }

   #+END_SRC

** Un-Compress by context
   #+BEGIN_SRC sh :tangle shrc
     deconvolute() {
         if [ ! -f "${1}" ]; then
             echo "${1}: no such file";
         else
             case "${1}" in
                 ,*.tar.bz2) tar -xjf "${1}" ;;
                 ,*.tbz2) tar -xjf "${1}" ;;
                 ,*.tar.gz) tar -x --use-compress-program=pigz -f "${1}" ;;
                 ,*.tgz) tar -x --use-compress-program=pigz -f "${1}" ;;
                 ,*.gz) unpigz "${1}" ;;
                 ,*.rar) unrar -x "${1}" ;;
                 ,*.tar) tar -xf "${1}" ;;
                 ,*.zip) unzip "${1}" ;;
                 ,*.tar.xz) tar -xf "${1}" ;;
                 ,*) echo "Cannot extract ${1}, provide explicit command";;
             esac
         fi
     }
   #+END_SRC

** Navigate
   - When no virtualenv is active, but one is available, switch to it
   #+BEGIN_SRC sh :tangle shrc
     cd () {
         if [ -z "${1}" ]; then
             builtin cd "${HOME}" || true
         else
             builtin cd "${1}"  || true
         fi
         if [ -z "${VIRTUAL_ENV}" ]; then
             to_venv 2>/dev/null
         fi
     }
   #+END_SRC

   - Inspired by lukesmith.xyz
   #+BEGIN_SRC sh :tangle shrc
     lfcd () {
         if ! command -v 'lf' >/dev/null 2>/dev/null; then
             return
         fi
         tmp_file="$(mktemp)"
         lf -last-dir-path="${tmp_file}" "$@"
         if [ -f "${tmp_file}" ]; then
             target_dir="$(cat "${tmp_file}")"
             rm -f "${tmp_file}" >/dev/null
             if [ -d "${target_dir}" ] && [ "${target_dir}" != "$(pwd)" ]; then
                 cd "${target_dir}" || return
             fi
         fi
         unset tmp_file
         unset target_dir
     }
     fzfcd () {
         cd "$(dirname "$(fzf)")" || true
     }
   #+END_SRC

