docs/literate-config.html

<div id="outline-container-org4043936" class="outline-3">
<h3 id="org4043936">Launch gui</h3>
<div class="outline-text-3" id="text-org4043936">
<p>
Launch application and exit terminal window
Acts like a launcher
Uninteractive terminal commands may also be called
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">gui</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">usage</span>=<span style="color: #98be65;">"usage: $0 [-h|--help] CMD\n"</span>
    <span style="color: #ffffaf;">cmd_help</span>=<span style="color: #98be65;">"Launch CMD, switch to it, and exit the parent terminal\n\n"</span>
    <span style="color: #ffffaf;">cmd_help</span>=<span style="color: #98be65;">"${cmd_help}Optional arguments:\n"</span>
    <span style="color: #ffffaf;">cmd_help</span>=<span style="color: #98be65;">"${cmd_help}-h|--help\tdisplay this help and exit\n"</span>
    <span style="color: #ffffaf;">cmd</span>=
    <span style="color: #ffffaf;">call</span>=

    <span style="color: #51afef;">while</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">#</span> -gt <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">case</span> <span style="color: #98be65;">"$1"</span><span style="color: #51afef;"> in</span>
            --help|-h)
                printf <span style="color: #98be65;">"%s""${usage}"</span>
                printf <span style="color: #98be65;">"%s""${cmd_help}"</span>
                <span style="color: #d76f10;">shift</span> <span style="color: #da8548; font-weight: bold;">1</span>
                <span style="color: #d76f10;">unset</span> cmd
                <span style="color: #d76f10;">unset</span> cmd_help
                <span style="color: #d76f10;">unset</span> usage
                <span style="color: #d76f10;">unset</span> call
                <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>
                ;;
            --)
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">end of gui arguments</span>
                <span style="color: #ffffaf;">cmd</span>=<span style="color: #98be65;">"${cmd} $*"</span>
                <span style="color: #51afef;">break</span>
                ;;
            *)
                <span style="color: #ffffaf;">cmd</span>=<span style="color: #98be65;">"${1}"</span>
                <span style="color: #d76f10;">shift</span> <span style="color: #da8548; font-weight: bold;">1</span>
                ;;
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">done</span>

    <span style="color: #ffffaf;">call</span>=<span style="color: #98be65;">"$(echo "${cmd}" | cut -d " " -f 1)"</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${call}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v <span style="color: #98be65;">"${call}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
            <span style="color: #d76f10;">unset</span> cmd_help
            <span style="color: #d76f10;">unset</span> usage
            <span style="color: #d76f10;">unset</span> call
            nohup <span style="color: #98be65;">"${cmd}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">0</span>&lt;&amp;- <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span> &amp; <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">0</span>
        <span style="color: #51afef;">else</span>
            <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"${call} not found..."</span>
            <span style="color: #d76f10;">unset</span> cmd
            <span style="color: #d76f10;">unset</span> cmd_help
            <span style="color: #d76f10;">unset</span> usage
            <span style="color: #d76f10;">unset</span> call
            <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">127</span>
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">else</span>
        printf <span style="color: #98be65;">"%s""${usage}"</span>
        <span style="color: #d76f10;">unset</span> cmd
        <span style="color: #d76f10;">unset</span> cmd_help
        <span style="color: #d76f10;">unset</span> usage
        <span style="color: #d76f10;">unset</span> call
        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #51afef;">fi</span>

<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org6cb268f" class="outline-3">
<h3 id="org6cb268f">Un-Compress by context</h3>
<div class="outline-text-3" id="text-org6cb268f">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">deconvolute</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #51afef; font-weight: bold;">!</span> -f <span style="color: #98be65;">"${1}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"${1}: no such file"</span>;
    <span style="color: #51afef;">else</span>
        <span style="color: #51afef;">case</span> <span style="color: #98be65;">"${1}"</span><span style="color: #51afef;"> in</span>
            *.tar.bz2) tar -xjf <span style="color: #98be65;">"${1}"</span> ;;
            *.tbz2) tar -xjf <span style="color: #98be65;">"${1}"</span> ;;
            *.tar.gz) tar -x --use-compress-program=pigz -f <span style="color: #98be65;">"${1}"</span> ;;
            *.tgz) tar -x --use-compress-program=pigz -f <span style="color: #98be65;">"${1}"</span> ;;
            *.gz) unpigz <span style="color: #98be65;">"${1}"</span> ;;
            *.rar) unrar -x <span style="color: #98be65;">"${1}"</span> ;;
            *.tar) tar -xf <span style="color: #98be65;">"${1}"</span> ;;
            *.zip) unzip <span style="color: #98be65;">"${1}"</span> ;;
            *.tar.xz) tar -xf <span style="color: #98be65;">"${1}"</span> ;;
            *) <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"Cannot extract ${1}, provide explicit command"</span>;;
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge181ee1" class="outline-3">
<h3 id="orge181ee1">Navigate</h3>
<div class="outline-text-3" id="text-orge181ee1">
<ul class="org-ul">
<li>When no virtualenv is active, but one is available, switch to it</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">cd</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${1}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #d76f10;">builtin</span> cd <span style="color: #98be65;">"${HOME}"</span> || <span style="color: #d76f10;">true</span>
    <span style="color: #51afef;">else</span>
        <span style="color: #d76f10;">builtin</span> cd <span style="color: #98be65;">"${1}"</span>  || <span style="color: #d76f10;">true</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${VIRTUAL_ENV}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        to_venv <span style="color: #da8548; font-weight: bold;">2</span>&gt;/dev/null
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<ul class="org-ul">
<li>Inspired by lukesmith.xyz</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">lfcd</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef; font-weight: bold;">!</span> command -v <span style="color: #98be65;">'lf'</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;/dev/null; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">return</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #ffffaf;">tmp_file</span>=<span style="color: #98be65;">"$(mktemp)"</span>
    lf -last-dir-path=<span style="color: #98be65;">"${tmp_file}"</span> <span style="color: #98be65;">"$@"</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -f <span style="color: #98be65;">"${tmp_file}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">target_dir</span>=<span style="color: #98be65;">"$(cat "${tmp_file}")"</span>
        rm -f <span style="color: #98be65;">"${tmp_file}"</span> &gt;/dev/null
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -d <span style="color: #98be65;">"${target_dir}"</span> <span style="color: #c678dd;">]</span> &amp;&amp; <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${target_dir}"</span> != <span style="color: #98be65;">"$(pwd)"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #d76f10;">cd</span> <span style="color: #98be65;">"${target_dir}"</span> || <span style="color: #51afef;">return</span>
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #d76f10;">unset</span> tmp_file
    <span style="color: #d76f10;">unset</span> target_dir
<span style="color: #51afef;">}</span>
<span style="color: #9f5f9f; font-weight: bold;">fzfcd</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #d76f10;">cd</span> <span style="color: #98be65;">"$(dirname "$(fzf)")"</span> || <span style="color: #d76f10;">true</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
