literate-config.org
** zwc
   - Guess whether target is zipped;
     if zipped, unzip and count else classical wc
   #+begin_src sh :tangle shrc
     zwc () {
         args="$*"
         fname="${args##* }"
         args="${args% ${fname}}"
         args="${args%${fname}}"

         if gzip -t "${fname}" > /dev/null 2>&1; then
             if [ -z "${args}" ]; then
                 zcat -f "${fname}" | wc
             else
                 # shellcheck disable=SC2086
                 zcat -f "${fname}" | wc $args
             fi
             return
         else
             wc "$@"
             return
         fi

     }
   #+end_src

** disable autovenv
   - To disable autoswitching virtualenvs, hard-set VIRTUAL_ENV
     - Calling the function again reverts
   #+BEGIN_SRC sh :tangle shrc
     force_global_venv () {
         if [ "${VIRTUAL_ENV}" = "Global_Env" ]; then
             unset VIRTUAL_ENV
             to_venv 2>/dev/null
         else
             deactivate
             VIRTUAL_ENV="Global_Env"
         fi
     }
   #+END_SRC

** lszcat
   #+begin_src sh :tangle shrc
     lszcat () {
         args="$*"
         fname="${args##* }"
         args="${args%% ${fname}}"
         args="${args%%${fname}}"

         if builtin command -v bat >/dev/null 2>&1; then
             betcat="$(which bat)"
         else
             betcat="$(which cat)"
         fi

         if builtin command -v exa >/dev/null 2>&1; then
             betls="$(which exa)"
         else
             betls="$(which ls)"
         fi

         if [ -z "${fname}" ] || [ ! "${fname#-}" = "${fname}" ]; then
             if [ -z "${args}" ]; then
                 args="${fname}"
             else
                 args="${args} ${fname}"
             fi
             fname="$(readlink -f ".")"
             echo "${fname}"
         fi

         if [ -d "${fname}" ]; then
             # shellcheck disable=SC2086
             "${betls}" ${args} "${fname}"
         elif gzip -t "${fname}" >/dev/null 2>&1; then
             # shellcheck disable=SC2086
             zcat -f ${args} "${fname}" | "${betcat}"
         else
             # shellcheck disable=SC2086
             "${betcat}" ${args} "${fname}"
         fi
     }
   #+end_src

** manual pages
   #+BEGIN_SRC sh :tangle shrc
     man_help () {
         if man "$@"; then
             return 0
         elif tldr "$@"; then
             return 0
         elif builtin command -v "$1" >/dev/null 2>/dev/null; then
             printf "trying to display %s --help output\n" "${1}"
             if builtin command -v 'bat' >/dev/null 2>/dev/null; then
                 $1 --help 2>&1 | bat
             else
                 $1 --help 2>&1 | less -RF
             fi
             return 0
         else
             return 16
         fi
     }
   #+END_SRC

* Aliases
** Disk Usage
   #+BEGIN_SRC sh :tangle shrc
     alias du='du -hc';
     alias df='df -h';
     alias duall="du -hc |\grep '^[3-9]\{3\}M\|^[0-9]\{0,3\}\.\{0,1\}[0-9]\{0,1\}G'";
   #+END_SRC

** manual page help
   #+BEGIN_SRC sh :tangle shrc
     alias man="man_help";
   #+END_SRC
