docs/literate-config.html

<div id="outline-container-org6cfe849" class="outline-3">
<h3 id="org6cfe849">zwc</h3>
<div class="outline-text-3" id="text-org6cfe849">
<ul class="org-ul">
<li>Guess whether target is zipped;
if zipped, unzip and count else classical wc</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">zwc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"$*"</span>
    <span style="color: #ffffaf;">fname</span>=<span style="color: #98be65;">"${args##* }"</span>
    <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"${args% ${fname}}"</span>
    <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"${args%${fname}}"</span>

    <span style="color: #51afef;">if</span> gzip -t <span style="color: #98be65;">"${fname}"</span> &gt; /dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${args}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            zcat -f <span style="color: #98be65;">"${fname}"</span> | wc
        <span style="color: #51afef;">else</span>
            <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2086</span>
            zcat -f <span style="color: #98be65;">"${fname}"</span> | wc $<span style="color: #ffffaf;">args</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #51afef;">return</span>
    <span style="color: #51afef;">else</span>
        wc <span style="color: #98be65;">"$@"</span>
        <span style="color: #51afef;">return</span>
    <span style="color: #51afef;">fi</span>

<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd22bc95" class="outline-3">
<h3 id="orgd22bc95">disable autovenv</h3>
<div class="outline-text-3" id="text-orgd22bc95">
<ul class="org-ul">
<li>To disable autoswitching virtualenvs, hard-set VIRTUAL_ENV
<ul class="org-ul">
<li>Calling the function again reverts</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">force_global_venv</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${VIRTUAL_ENV}"</span> = <span style="color: #98be65;">"Global_Env"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #d76f10;">unset</span> VIRTUAL_ENV
        to_venv <span style="color: #da8548; font-weight: bold;">2</span>&gt;/dev/null
    <span style="color: #51afef;">else</span>
        deactivate <span style="color: #da8548; font-weight: bold;">2</span>&gt;/dev/null
        <span style="color: #ffffaf;">VIRTUAL_ENV</span>=<span style="color: #98be65;">"Global_Env"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7b1dba" class="outline-3">
<h3 id="orge7b1dba">lszcat</h3>
<div class="outline-text-3" id="text-orge7b1dba">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">lszcat</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"$*"</span>
    <span style="color: #ffffaf;">fname</span>=<span style="color: #98be65;">"${args##* }"</span>
    <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"${args%% ${fname}}"</span>
    <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"${args%%${fname}}"</span>

    <span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v bat &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">betcat</span>=<span style="color: #98be65;">"$(which bat)"</span>
    <span style="color: #51afef;">else</span>
        <span style="color: #ffffaf;">betcat</span>=<span style="color: #98be65;">"$(which cat)"</span>
    <span style="color: #51afef;">fi</span>

    <span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v exa &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">betls</span>=<span style="color: #98be65;">"$(which exa)"</span>
    <span style="color: #51afef;">else</span>
        <span style="color: #ffffaf;">betls</span>=<span style="color: #98be65;">"$(which ls)"</span>
    <span style="color: #51afef;">fi</span>

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${fname}"</span> <span style="color: #c678dd;">]</span> || <span style="color: #c678dd;">[</span> <span style="color: #51afef; font-weight: bold;">!</span> <span style="color: #98be65;">"${fname#-}"</span> = <span style="color: #98be65;">"${fname}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${args}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"${fname}"</span>
        <span style="color: #51afef;">else</span>
            <span style="color: #ffffaf;">args</span>=<span style="color: #98be65;">"${args} ${fname}"</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #ffffaf;">fname</span>=<span style="color: #98be65;">"$(readlink -f ".")"</span>
        <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"${fname}"</span>
    <span style="color: #51afef;">fi</span>

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -d <span style="color: #98be65;">"${fname}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2086</span>
        <span style="color: #98be65;">"${betls}"</span> $<span style="color: #c678dd;">{</span><span style="color: #ffffaf;">args</span><span style="color: #c678dd;">}</span> <span style="color: #98be65;">"${fname}"</span>
    <span style="color: #51afef;">elif</span> gzip -t <span style="color: #98be65;">"${fname}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2086</span>
        zcat -f $<span style="color: #c678dd;">{</span><span style="color: #ffffaf;">args</span><span style="color: #c678dd;">}</span> <span style="color: #98be65;">"${fname}"</span> | <span style="color: #98be65;">"${betcat}"</span>
    <span style="color: #51afef;">else</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2086</span>
        <span style="color: #98be65;">"${betcat}"</span> $<span style="color: #c678dd;">{</span><span style="color: #ffffaf;">args</span><span style="color: #c678dd;">}</span> <span style="color: #98be65;">"${fname}"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab69296" class="outline-3">
<h3 id="orgab69296">manual pages</h3>
<div class="outline-text-3" id="text-orgab69296">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">man_help</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> man <span style="color: #98be65;">"$@"</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>
    <span style="color: #51afef;">elif</span> tldr <span style="color: #98be65;">"$@"</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>
    <span style="color: #51afef;">elif </span><span style="color: #d76f10;">builtin</span> command -v <span style="color: #98be65;">"$1"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;/dev/null; <span style="color: #51afef;">then</span>
        printf <span style="color: #98be65;">"trying to display %s --help output\n"</span> <span style="color: #98be65;">"${1}"</span>
        <span style="color: #51afef;">if </span><span style="color: #d76f10;">builtin</span> command -v <span style="color: #98be65;">'bat'</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;/dev/null; <span style="color: #51afef;">then</span>
            $<span style="color: #da8548; font-weight: bold;">1</span> --help <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span> | bat
        <span style="color: #51afef;">else</span>
            $<span style="color: #da8548; font-weight: bold;">1</span> --help <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span> | less -RF
        <span style="color: #51afef;">fi</span>
        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>
    <span style="color: #51afef;">else</span>
        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">16</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc94658d" class="outline-2">
<h2 id="orgc94658d">Aliases</h2>
<div class="outline-text-2" id="text-orgc94658d">
</div>
<div id="outline-container-org2c0b6c8" class="outline-3">
<h3 id="org2c0b6c8">Disk Usage</h3>
<div class="outline-text-3" id="text-org2c0b6c8">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">du</span>=<span style="color: #98be65;">'du -hc'</span>;
<span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">df</span>=<span style="color: #98be65;">'df -h'</span>;
<span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">duall</span>=<span style="color: #98be65;">"du -hc |\grep '^[3-9]\{3\}M\|^[0-9]\{0,3\}\.\{0,1\}[0-9]\{0,1\}G'"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bc2c02" class="outline-3">
<h3 id="org4bc2c02">manual page help</h3>
<div class="outline-text-3" id="text-org4bc2c02">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">man</span>=<span style="color: #98be65;">"man_help"</span>;
</pre>
</div>
</div>
</div>
