literate-config.org
** Network
   #+BEGIN_SRC sh :tangle shrc
     alias nload='nload -u M -U G -t 10000 -a 3600 $(ip a | grep -m 1 " UP " | cut -d " " -f 2 | cut -d ":" -f 1)'
     alias nethogs='\su - -c "nethogs $(ip a |grep  "state UP" | cut -d " " -f 2 | cut -d ":" -f 1) -d 10"';
     alias ping="ping -c 4 ";
   #+END_SRC

** Monitor Job queues
   #+BEGIN_SRC sh :tangle shrc
     alias watch="watch -n 10 --color";
   #+END_SRC

** Lazy single-handed exit
   #+BEGIN_SRC sh :tangle shrc
     alias qqqq="exit";
   #+END_SRC

** [z]wc
   #+begin_src sh :tangle shrc
     alias wc="zwc";
   #+end_src


* Networking
** State
   Display state of network connection at the beginning
   #+BEGIN_SRC sh :tangle shrc
     # shellcheck source=./netcheck.sh
     IFS="$(printf '\t')" read -r IP_ADDR AP_ADDR netstate << netcheck
     $("${RUNCOMDIR}"/netcheck.sh)
     netcheck
     export IP_ADDR
     export AP_ADDR
     if [ "${netstate}" -gt 7 ]; then
         printf "\e[1;34mInternet (GOOGLE) Connected\e[m\n"
         printf "\033[0;32m%s \e[m is current wireless ip address\n" "$IP_ADDR"
     else
         printf "\e[1;31mInternet (GOOGLE) Not reachable\e[m\n"
         if [ $(( netstate % 8 )) -gt 3 ]; then  # Intranet is connected
             printf "\033[0;31mInternet Down\e[m\n"
             case $(( netstate % 4 )) in
                 2) printf "Home network connected,\n"
                    ;;
                 1) printf "OFFICE network connected,\n"
                    # shellcheck source=./proxy_send.py
                    if [ -f "${RUNCOMDIR}/proxy_send.py" ]; then
                        # shellcheck source=./proxy_send.py
                        "${RUNCOMDIR}/proxy_send.py" \
                            && printf "\e[0;33mPROXY AUTH SENT\e[m\n";
                    fi
                    ;;
                 ,*) printf "HOTSPOT connected\n"
                    ;;
             esac
         else
             printf "\e[1;33mNetwork connection Disconnected\e[m\n"
         fi
     fi
   #+END_SRC

** SSH Agent
   Reuse ssh agent for all logins
   #+BEGIN_SRC sh :tangle ui
     if [ ! -S ~/.ssh/ssh_auth_sock ]; then
         eval "$(ssh-agent)"
         ln -sf "$SSH_AUTH_SOCK" ~/.ssh/ssh_auth_sock
     fi
     SSH_AUTH_SOCK=~/.ssh/ssh_auth_sock
     export SSH_AUTH_SOCK
     ssh-add -l > /dev/null || ssh-add
   #+END_SRC

* Window Manager settings
** Terminal
   #+BEGIN_SRC sh :tangle ui
     for term in foot termite tilix xterm gnome-terminal; do
         if [ -n "$(builtin command -v $term)" ]; then
             defterm="$term";
             export defterm
             break;
         fi;
     done
   #+END_SRC

** Sway exports
   Don't really remember why these were made
   Not using currently. Preserved for future
   tangle to bash_login
   export WLR_BACKENDS="headless";
   export WLR_LIBINPUT_NO_DEVICES=1;

