docs/literate-config.html
<div id="outline-container-org7b293d4" class="outline-3">
<h3 id="org7b293d4">Network</h3>
<div class="outline-text-3" id="text-org7b293d4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">nload</span>=<span style="color: #98be65;">'nload -u M -U G -t 10000 -a 3600 $(ip a | grep -m 1 " UP " | cut -d " " -f 2 | cut -d ":" -f 1)'</span>
<span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">nethogs</span>=<span style="color: #98be65;">'\su - -c "nethogs $(ip a |grep  "state UP" | cut -d " " -f 2 | cut -d ":" -f 1) -d 10"'</span>;
<span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">ping</span>=<span style="color: #98be65;">"ping -c 4 "</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9fdd9f" class="outline-3">
<h3 id="orgf9fdd9f">Monitor Job queues</h3>
<div class="outline-text-3" id="text-orgf9fdd9f">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">watch</span>=<span style="color: #98be65;">"watch -n 10 --color"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ae983d" class="outline-3">
<h3 id="org1ae983d">Lazy single-handed exit</h3>
<div class="outline-text-3" id="text-org1ae983d">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">qqqq</span>=<span style="color: #98be65;">"exit"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2f084f" class="outline-3">
<h3 id="orge2f084f">[z]wc</h3>
<div class="outline-text-3" id="text-orge2f084f">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d76f10;">alias</span> <span style="color: #ffffaf;">wc</span>=<span style="color: #98be65;">"zwc"</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgef497b6" class="outline-2">
<h2 id="orgef497b6">Networking</h2>
<div class="outline-text-2" id="text-orgef497b6">
</div>
<div id="outline-container-orgd59fcd7" class="outline-3">
<h3 id="orgd59fcd7">State</h3>
<div class="outline-text-3" id="text-orgd59fcd7">
<p>
Display state of network connection at the beginning
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=./netcheck.sh</span>
<span style="color: #ffffaf;">IFS</span>=<span style="color: #98be65;">"$(printf '\t')"</span> read -r IP_ADDR AP_ADDR netstate &lt;&lt; netcheck
<span style="color: #98be65;">$("${RUNCOMDIR}"/netcheck.sh)</span>
<span style="color: #98be65;">netcheck</span>
<span style="color: #d76f10;">export</span> IP_ADDR
<span style="color: #d76f10;">export</span> AP_ADDR
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> <span style="color: #98be65;">"${netstate}"</span> -gt <span style="color: #da8548; font-weight: bold;">7</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #63B4F6;">\e[1;34m</span><span style="color: #98be65;">Internet (GOOGLE) Connected\e[m\n"</span>
    printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #59963A;">\033[0;32m</span><span style="color: #98be65;">%s \e[m is current wireless ip address\n"</span> <span style="color: #98be65;">"$IP_ADDR"</span>
<span style="color: #51afef;">else</span>
    printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #EC6261;">\e[1;31m</span><span style="color: #98be65;">Internet (GOOGLE) Not reachable\e[m\n"</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> $<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span> netstate % <span style="color: #da8548; font-weight: bold;">8</span> <span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> -gt <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>  <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Intranet is connected</span>
        printf <span style="color: #98be65;">"</span><span style="color: #ffffff; background-color: #A93F43;">\033[0;31m</span><span style="color: #98be65;">Internet Down\e[m\n"</span>
        <span style="color: #51afef;">case</span> $<span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span> netstate % <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">in</span>
            <span style="color: #da8548; font-weight: bold;">2</span>) printf <span style="color: #98be65;">"Home network connected,\n"</span>
               ;;
            <span style="color: #da8548; font-weight: bold;">1</span>) printf <span style="color: #98be65;">"OFFICE network connected,\n"</span>
               <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=./proxy_send.py</span>
               <span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -f <span style="color: #98be65;">"${RUNCOMDIR}/proxy_send.py"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
                   <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck source=./proxy_send.py</span>
                   <span style="color: #98be65;">"${RUNCOMDIR}/proxy_send.py"</span> <span style="color: #98be65;">\</span>
                       &amp;&amp; printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #BE8A2D;">\e[0;33m</span><span style="color: #98be65;">PROXY AUTH </span><span style="color: #3f9f9f;">SENT</span><span style="color: #98be65;">\e[m\n"</span>;
               <span style="color: #51afef;">fi</span>
               ;;
            *) printf <span style="color: #98be65;">"HOTSPOT connected\n"</span>
               ;;
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">else</span>
        printf <span style="color: #98be65;">"</span><span style="color: #000000; background-color: #F0C649;">\e[1;33m</span><span style="color: #98be65;">Network connection Disconnected\e[m\n"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b89bb9" class="outline-3">
<h3 id="org7b89bb9">SSH Agent</h3>
<div class="outline-text-3" id="text-org7b89bb9">
<p>
Reuse ssh agent for all logins
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> <span style="color: #51afef; font-weight: bold;">!</span> -S ~/.ssh/ssh_auth_sock <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    <span style="color: #d76f10;">eval</span> <span style="color: #98be65;">"$(ssh-agent)"</span>
    ln -sf <span style="color: #98be65;">"$SSH_AUTH_SOCK"</span> ~/.ssh/ssh_auth_sock
<span style="color: #51afef;">fi</span>
<span style="color: #ffffaf;">SSH_AUTH_SOCK</span>=~/.ssh/ssh_auth_sock
<span style="color: #d76f10;">export</span> SSH_AUTH_SOCK
ssh-add -l &gt; /dev/null || ssh-add
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge1abd8b" class="outline-2">
<h2 id="orge1abd8b">Window Manager settings</h2>
<div class="outline-text-2" id="text-orge1abd8b">
</div>
<div id="outline-container-org563f013" class="outline-3">
<h3 id="org563f013">Terminal</h3>
<div class="outline-text-3" id="text-org563f013">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">for</span> term<span style="color: #51afef;"> in</span> foot termite tilix xterm gnome-terminal; <span style="color: #51afef;">do</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -n <span style="color: #98be65;">"$(builtin command -v $term)"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">defterm</span>=<span style="color: #98be65;">"$term"</span>;
        <span style="color: #d76f10;">export</span> defterm
        <span style="color: #51afef;">break</span>;
    <span style="color: #51afef;">fi</span>;
<span style="color: #51afef;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2689ee" class="outline-3">
<h3 id="orge2689ee">Sway exports</h3>
<div class="outline-text-3" id="text-orge2689ee">
<p>
Don't really remember why these were made
Not using currently. Preserved for future
tangle to bash_login
export WLR_BACKENDS="headless";
export WLR_LIBINPUT_NO_DEVICES=1;
</p>
</div>
</div>
