literate-config.org
** User Interface (GUI/CLI)
   If running from tty1 setup sway environment and start ui
   #+BEGIN_SRC sh :tangle ui
     if [ "$(tty)" = "/dev/tty1" ]; then
         if sway --validate; then
             # export DISPLAY=":0"
             # export WAYLAND_DISPLAY=wayland-0
             # export GDK_BACKEND=wayland,x11
             if [ -z "$XDG_RUNTIME_DIR" ]; then
                 XDG_RUNTIME_DIR="/run/user/$(id -u)"
             fi
             XDG_SESSION_TYPE=wayland
             SDL_VIDEODRIVER=wayland
             ECORE_EVAS_ENGINE=wayland_egl
             ELM_DISPLAY=wl
             ELM_ENGINE=wayland_egl
             ELM_ACCEL=opengl
             QT_QPA_PLATFORM=wayland-egl
             QT_WAYLAND_FORCE_DPI=100
             QT_PLUGIN_PATH=/usr/lib/kde4/plugins/
             QT_AUTO_SCREEN_SCALE_FACTOR=0
             QT_QPA_PLATFORMTHEME=gtk3
             QT_WAYLAND_DISABLE_WINDOWDECORATION=1
             MOZ_ENABLE_WAYLAND=1
             _JAVA_AWT_WM_NONREPARENTING=1
             SWAYROOT="${XDG_CONFIG_HOME:-${HOME}/.config}"/sway
             export XDG_SESSION_TYPE
             export SDL_VIDEODRIVER
             export ECORE_EVAS_ENGINE
             export ELM_DISPLAY
             export ELM_ENGINE
             export ELM_ACCEL
             export QT_QPA_PLATFORM
             export QT_WAYLAND_FORCE_DPI
             export QT_PLUGIN_PATH
             export QT_AUTO_SCREEN_SCALE_FACTOR
             export QT_QPA_PLATFORMTHEME
             export QT_WAYLAND_DISABLE_WINDOWDECORATION
             export DBUS_SESSION_BUS_ADDRESS
             export DBUS_SESSION_BUS_PID
             export MOZ_ENABLE_WAYLAND
             export _JAVA_AWT_WM_NONREPARENTING
             export SWAYROOT
             exec dbus-launch --sh-syntax --exit-with-session sway
         else
             echo "Error while validating sway configuration"
         fi
     elif [ "$TERM" = "linux" ]; then
         printf "\e]P0000000" #black
         printf "\e]P83f3f3f" #darkgrey
         printf "\e]P19f3f3f" #darkred
         printf "\e]P9ff9f9f" #red
         printf "\e]P23f9f3f" #darkgreen
         printf "\e]PAbfefbf" #green
         printf "\e]P3bf9f3f" #brown
         printf "\e]PB9fff9f" #yellow
         printf "\e]P45f5f9f" #darkblue
         printf "\e]PC9f9fff" #blue
         printf "\e]P59f3f9f" #darkmagenta
         printf "\e]PDff9fff" #magenta
         printf "\e]P63f9f9f" #darkcyan
         printf "\e]PE9fffff" #cyan
         printf "\e]P7afafaf" #lightgrey
         printf "\e]PFffffff" #white
         clear #for background artifacting
     fi
   #+END_SRC

* Calls
** bash
   #+BEGIN_SRC bash :tangle bash_login
     # netcheck source=.local/share/pspman/src/runcom/ui
     if [ -f "${RUNCOMDIR}"/ui ]; then
         . "${RUNCOMDIR}"/ui
     fi
   #+END_SRC

** zsh
   #+BEGIN_SRC bash :tangle zlogin
     # netcheck source=.local/share/pspman/src/runcom/ui
     if [ -f "${RUNCOMDIR}"/ui ]; then
         . "${RUNCOMDIR}"/ui
     fi
   #+END_SRC
