docs/literate-config.html

<div id="outline-container-orge674b6b" class="outline-3">
<h3 id="orge674b6b">User Interface (GUI/CLI)</h3>
<div class="outline-text-3" id="text-orge674b6b">
<p>
If running from tty1 setup sway environment and start ui
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> <span style="color: #98be65;">"$(tty)"</span> = <span style="color: #98be65;">"/dev/tty1"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    <span style="color: #51afef;">if</span> sway --validate; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">export DISPLAY=":0"</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">export WAYLAND_DISPLAY=wayland-0</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">export GDK_BACKEND=wayland,x11</span>
        <span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -z <span style="color: #98be65;">"$XDG_RUNTIME_DIR"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #ffffaf;">XDG_RUNTIME_DIR</span>=<span style="color: #98be65;">"/run/user/$(id -u)"</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #ffffaf;">XDG_SESSION_TYPE</span>=wayland
        <span style="color: #ffffaf;">SDL_VIDEODRIVER</span>=wayland
        <span style="color: #ffffaf;">ECORE_EVAS_ENGINE</span>=wayland_egl
        <span style="color: #ffffaf;">ELM_DISPLAY</span>=wl
        <span style="color: #ffffaf;">ELM_ENGINE</span>=wayland_egl
        <span style="color: #ffffaf;">ELM_ACCEL</span>=opengl
        <span style="color: #ffffaf;">QT_QPA_PLATFORM</span>=wayland-egl
        <span style="color: #ffffaf;">QT_WAYLAND_FORCE_DPI</span>=<span style="color: #da8548; font-weight: bold;">100</span>
        <span style="color: #ffffaf;">QT_PLUGIN_PATH</span>=/usr/lib/kde4/plugins/
        <span style="color: #ffffaf;">QT_AUTO_SCREEN_SCALE_FACTOR</span>=<span style="color: #da8548; font-weight: bold;">0</span>
        <span style="color: #ffffaf;">QT_QPA_PLATFORMTHEME</span>=gtk3
        <span style="color: #ffffaf;">QT_WAYLAND_DISABLE_WINDOWDECORATION</span>=<span style="color: #da8548; font-weight: bold;">1</span>
        <span style="color: #ffffaf;">MOZ_ENABLE_WAYLAND</span>=<span style="color: #da8548; font-weight: bold;">1</span>
        <span style="color: #ffffaf;">_JAVA_AWT_WM_NONREPARENTING</span>=<span style="color: #da8548; font-weight: bold;">1</span>
        <span style="color: #ffffaf;">SWAYROOT</span>=<span style="color: #98be65;">"${XDG_CONFIG_HOME:-${HOME}/.config}"</span>/sway
        <span style="color: #d76f10;">export</span> XDG_SESSION_TYPE
        <span style="color: #d76f10;">export</span> SDL_VIDEODRIVER
        <span style="color: #d76f10;">export</span> ECORE_EVAS_ENGINE
        <span style="color: #d76f10;">export</span> ELM_DISPLAY
        <span style="color: #d76f10;">export</span> ELM_ENGINE
        <span style="color: #d76f10;">export</span> ELM_ACCEL
        <span style="color: #d76f10;">export</span> QT_QPA_PLATFORM
        <span style="color: #d76f10;">export</span> QT_WAYLAND_FORCE_DPI
        <span style="color: #d76f10;">export</span> QT_PLUGIN_PATH
        <span style="color: #d76f10;">export</span> QT_AUTO_SCREEN_SCALE_FACTOR
        <span style="color: #d76f10;">export</span> QT_QPA_PLATFORMTHEME
        <span style="color: #d76f10;">export</span> QT_WAYLAND_DISABLE_WINDOWDECORATION
        <span style="color: #d76f10;">export</span> DBUS_SESSION_BUS_ADDRESS
        <span style="color: #d76f10;">export</span> DBUS_SESSION_BUS_PID
        <span style="color: #d76f10;">export</span> MOZ_ENABLE_WAYLAND
        <span style="color: #d76f10;">export</span> _JAVA_AWT_WM_NONREPARENTING
        <span style="color: #d76f10;">export</span> SWAYROOT
        <span style="color: #51afef;">exec</span> dbus-launch --sh-syntax --exit-with-session sway
    <span style="color: #51afef;">else</span>
        <span style="color: #d76f10;">echo</span> <span style="color: #98be65;">"Error while validating sway configuration"</span>
    <span style="color: #51afef;">fi</span>
<span style="color: #51afef;">elif</span> <span style="color: #51afef;">[</span> <span style="color: #98be65;">"$TERM"</span> = <span style="color: #98be65;">"linux"</span> <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    printf <span style="color: #98be65;">"\e]P0000000"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">black</span>
    printf <span style="color: #98be65;">"\e]P83f3f3f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">darkgrey</span>
    printf <span style="color: #98be65;">"\e]P19f3f3f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">darkred</span>
    printf <span style="color: #98be65;">"\e]P9ff9f9f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">red</span>
    printf <span style="color: #98be65;">"\e]P23f9f3f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">darkgreen</span>
    printf <span style="color: #98be65;">"\e]PAbfefbf"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">green</span>
    printf <span style="color: #98be65;">"\e]P3bf9f3f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">brown</span>
    printf <span style="color: #98be65;">"\e]PB9fff9f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">yellow</span>
    printf <span style="color: #98be65;">"\e]P45f5f9f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">darkblue</span>
    printf <span style="color: #98be65;">"\e]PC9f9fff"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">blue</span>
    printf <span style="color: #98be65;">"\e]P59f3f9f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">darkmagenta</span>
    printf <span style="color: #98be65;">"\e]PDff9fff"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">magenta</span>
    printf <span style="color: #98be65;">"\e]P63f9f9f"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">darkcyan</span>
    printf <span style="color: #98be65;">"\e]PE9fffff"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">cyan</span>
    printf <span style="color: #98be65;">"\e]P7afafaf"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">lightgrey</span>
    printf <span style="color: #98be65;">"\e]PFffffff"</span> <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">white</span>
    clear <span style="color: #3f4f5f; background-color: #0f0f0f;">#</span><span style="color: #3f4f5f; background-color: #0f0f0f;">for background artifacting</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc9b5591" class="outline-2">
<h2 id="orgc9b5591">Calls</h2>
<div class="outline-text-2" id="text-orgc9b5591">
</div>
<div id="outline-container-orga4a0bc2" class="outline-3">
<h3 id="orga4a0bc2">bash</h3>
<div class="outline-text-3" id="text-orga4a0bc2">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">netcheck source=.local/share/pspman/src/runcom/ui</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -f <span style="color: #98be65;">"${RUNCOMDIR}"</span>/ui <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    . <span style="color: #98be65;">"${RUNCOMDIR}"</span>/ui
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7f973b" class="outline-3">
<h3 id="orgc7f973b">zsh</h3>
<div class="outline-text-3" id="text-orgc7f973b">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">netcheck source=.local/share/pspman/src/runcom/ui</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span> -f <span style="color: #98be65;">"${RUNCOMDIR}"</span>/ui <span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
    . <span style="color: #98be65;">"${RUNCOMDIR}"</span>/ui
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
